{"status": "OK", "request_id": "78c8f25e-f45d-41db-9f62-66c083307228", "parameters": {"query": "data engineer jobs in uk", "page": 2, "num_pages": 4, "date_posted": "today"}, "data": [{"employer_name": "Michael Page", "employer_logo": "https://upload.wikimedia.org/wikipedia/commons/7/7d/PageGroup_Logo.jpg", "employer_website": "http://www.page.com", "employer_company_type": "Consulting", "job_publisher": "BeBee", "job_id": "crmY9Er2YScnYkk6AAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Data Engineer", "job_apply_link": "https://gb.bebee.com/job/20231221-94a8d6704ad925176f80939aace76a64", "job_apply_is_direct": false, "job_apply_quality_score": 0.4851, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-94a8d6704ad925176f80939aace76a64", "is_direct": false}], "job_description": "Data Engineer - BankingThe organisation is a major Listed Financial Services Group with offices Worldwide\n\nJob Description\nData Engineer - BankingResponsible for expanding and optimising the London Branch data and data pipeline architecture, as well as optimising data flow and collection for cross functional teams. This includes implementing improvements to existing processes and automating those that are manual in nature.Specific Responsibilities and Accountabilities:\n• Create and maintain optimal data pipeline architecture\n• Assemble large, complex data sets that meet functional / non-functional business requirements\n• Perform and run daily data download, aggregation and reporting tasks\n• Identify, design, and implement internal process improvements; automating manual processes, optimising data delivery and redesigning infrastructure for greater scalability\n• Conduct complex data analysis, reconciliations and reports\n• Combine raw information from different sources\n• Explore ways to enhance data quality and reliability\n• Identify opportunities for data acquisition\n• Documentation, storage and maintenance of all code in line with Group and London team standards\n• Participate in specific platform enablement projects from time to time, to conduct testing, regression, reconciliation, migration and other data and reporting validation exercises.\nKey Risk Management Responsibilities:\n\nIdentify, document and promptly escalate existing, potential and emerging risks to the Chief Risk Office or Compliance, as appropriate to the concern, to enable timely management of such risks. Ensure solution design adheres to BCBS239 principles\n\nThe Successful Applicant\nData Engineer - Banking Essential Qualifications and Experience:\n• Bachelor's Degree (Master's preferred) in Computer Science, Engineering or related field\n• 5+ years' experience in designing, building, and maintaining data processing systems in a financial services environment.\n• Extensive knowledge of database and other programming languages, including: Object-orientated programming in C# (preferred) or Java & extensive experience with SQL\nA detailed knowledge of the following:\n• Advanced Excel and database modelling/programming skills\n• Exposure to financial modelling, financial products or banking\nDesirable:\n• Knowledge of, or exposure to, Murex or similar trading system\n• Knowledge of, or exposure to, Bank of England taxonomies\n• Business Intelligence solutions such as OBIEE or PowerBI\nWhat's on Offer\nA basic salary of up to £80,000 plus extensive company benefits.\n\nContact\nJames McMillan\n\nQuote job ref\nJN-072021-2945949\n\nPhone number\n+44 799 098 5136", "job_is_remote": false, "job_posted_at_timestamp": 1703141607, "job_posted_at_datetime_utc": "2023-12-21T06:53:27.000Z", "job_city": "London", "job_state": null, "job_country": "GB", "job_latitude": 51.507217, "job_longitude": -0.1275862, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=crmY9Er2YScnYkk6AAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": 60, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": true, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4", "job_naics_code": "541613", "job_naics_name": "Marketing Consulting Services"}, {"employer_name": "Atom bank", "employer_logo": "https://upload.wikimedia.org/wikipedia/en/thumb/0/04/Atom_Bank_Logo.svg/800px-Atom_Bank_Logo.svg.png", "employer_website": "http://www.atombank.co.uk", "employer_company_type": null, "job_publisher": "LinkedIn", "job_id": "G4w4aTFB9SMIxcD-AAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Junior Data Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/junior-data-engineer-at-atom-bank-3790819042", "job_apply_is_direct": false, "job_apply_quality_score": 0.7494, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/junior-data-engineer-at-atom-bank-3790819042", "is_direct": false}], "job_description": "We’re Atom…\n\nThe bank that's leading the fintech charge!\n\nWe’re not like the rest. We’re true innovators, and we’re redefining what a bank should be. Ours is a bank for today and the future, a mobile-first bank. Forget the stuffy branches, with Atom you can bank whenever, wherever, faster, and simpler.\n\nCould you be the next innovator to join us?\n\nWhat will your typical day look like? Different that’s for sure…\n\nInsight and Intelligence drives Atom. The Insight and Intelligence team leverage Big Data technologies to maximise the returns from our data assets, by providing MI, exploratory analysis and predictive models which shape and deliver strategies in pricing, direct marketing, product optimisation, credit risk, fraud; help Atom Bank demonstrate that it is meeting its regulatory requirements and providing direct assistance to customers in their day-to-day banking activities.\n\nAs a Junior Data Science Engineer at Atom, you’ll help to create and maintain an efficient, sustainable and agile data analytics platform for a data driven digital bank. You’ll work with and gain exposure to a range of database technologies, whilst also learning about and working with a combination of event driven techniques and batch processing methodologies.\n\nYou’ll receive ongoing support and guidance from your coach and the wider Insight & Intelligence team as you continue to develop your skills and knowledge base. You’ll also have the opportunity to develop skills & knowledge in cloud-based data pipelines as part of a cross-functional team.\n\nYou will:\n• Build and maintain data ETL jobs using a range of tool including PostgreSQL, Talend, Python and Kafka.\n• Support work on cloud-based architecture to deliver robust data pipelines.\n• Assist with the design and integrity of data solutions delivered to the business.\n• Application of data availability, lineage, and quality to the correct deliverables.\n• Maintain robust and high-quality data throughout all design and implementation.\n• Adhere to data governance principles and standards.\n• Work collaboratively with the Data Science, Reporting and Data Engineering team in maintaining consistent and accurate data.\n• Continuously evaluate data processes and procedures to maintain a positive and efficient data culture within Atom.\n• Participate in daily stand-ups and discussions with developers, engineering teams and project managers.\n\nWhat do we need from you?\n• Ideally a degree in Data Analytics or similar field\n• Ability to learn new technologies and adapt to changing requirements.\n• Some experience of either relational SQL or analytics databases, such as Postgres, Cassandra & BigQuery.\n• Knowledge of Data Modelling, ETL development and Database/Data Warehousing, Structured and Unstructured data.\n• Excellent analytical, decision m king and problem-solving skills.\n• Awareness of how data can be used to drive operational and strategic decisions.\n\nWhat you’ll get from us?\n• Flexible Hybrid & Remote working.\n• 4-day work week.\n• Annual Share Option - performance-related.\n• Incredibly generous company pension scheme (maximum of 13% of Atom input - candidate can put in more).\n• ‘All About Me’ fund: £200 per year to spend on personal development.\n• 22.5 days annual leave plus public holidays.\n• Private Medical Insurance for you and your full family.\n• Health Cash Plan - expenses paid on Optical/Dental/other appointments/treatments.\n• Enhanced Parental Leave", "job_is_remote": false, "job_posted_at_timestamp": 1703092575, "job_posted_at_datetime_utc": "2023-12-20T17:16:15.000Z", "job_city": null, "job_state": null, "job_country": "GB", "job_latitude": 55.37805, "job_longitude": -3.435973, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=G4w4aTFB9SMIxcD-AAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T17:16:15.000Z", "job_offer_expiration_timestamp": 1705684575, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": true, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": 28000, "job_max_salary": 35000, "job_salary_currency": "GBP", "job_salary_period": "YEAR", "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "Lloyds Banking Group", "employer_logo": "https://upload.wikimedia.org/wikipedia/en/thumb/f/fe/Lloyds_Banking_Group_logo.svg/800px-Lloyds_Banking_Group_logo.svg.png", "employer_website": "http://www.lloydsbankinggroup.com", "employer_company_type": "Finance", "job_publisher": "Adzuna", "job_id": "AcnsNsFXnD7snNKnAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "head of Data Engineering", "job_apply_link": "https://www.adzuna.co.uk/jobs/details/4490123765", "job_apply_is_direct": false, "job_apply_quality_score": 0.5419, "apply_options": [{"publisher": "Adzuna", "apply_link": "https://www.adzuna.co.uk/jobs/details/4490123765", "is_direct": false}, {"publisher": "Jobijoba UK", "apply_link": "https://www.jobijoba.co.uk/detail/92/796dda75ad8d8ce4e971b824d32008dc", "is_direct": false}, {"publisher": "Jobrapido.com", "apply_link": "https://uk.jobrapido.com/jobpreview/771297839", "is_direct": false}, {"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231220-410d1f31b3f67b86cbc936455158a8f1", "is_direct": false}, {"publisher": "LifeworQ", "apply_link": "https://lifeworq.com/job/6e9863c6-6627-461d-ace5-24b5a4bf080b", "is_direct": false}], "job_description": "End Date\nSaturday 06 January 2024\n\nSalary Range\n£137,471 - £161,730\n\nWe support agile working – click here for more information on agile working options.\n\nAgile Working Options\nHybrid Working\n\nJob Description Summary\nLeads research and/or analytical specialists, shaping operating models, influencing key stakeholders and contributing to broader strategic planning and business decision making by providing insight, control and thought leadership.\n\nJob Description\n\nJOB TITLE: Head of Data Engineering - PEC\n\nSALARY: £130,000 - £195,000\n\nLOCATION(S): London or Bristol\n\nHOURS: [Full-time]\n\nWORKING PATTERN: Our work style is hybrid, which involves spending at least two days per week currently, or 40% of our time, at our London or Bristol Office\n\nAbout this opportunity…\n\nA fantastic opportunity has arisen for a Data Engineering leader to work within the Personalised Experiences and Communications Platform to join product engineering cross functional teams. As a head of data your responsibilities will be delivering the highest quality data capability, drawing upon your engineering expertise, whilst being open minded to the opportunities the cloud provides.\n\nHere’s where you’ll make a difference:\n• Lead the data engineering teams in designing, developing, testing, deploying, and maintaining high-quality, high-availability and scalable data pipelines and data products to provide personalised experiences for our twenty-six million customers and users.\n• Establish and enforce best practices, standards, and methodologies for data engineering, ensuring alignment with our business goals, customer needs, and industry trends.\n• Collaborate with product managers, data engineers, data scientists, AI engineers, and other stakeholders to define and prioritise the data engineering roadmap, scope, and deliverables.\n• Lead implementation of a data strategy aligned to the group’s data strategy.\n• Lead teams to define and deliver consumption patterns, data linage and data models and contracts.\n• Lead teams to create automation tools for data reconciliation and curation.\n• Drive the culture of delivering highly secured and high-quality data products.\n• Take the ownership and accountability of delivery, operations, risk management and TCO.\n• Lead teams in adopting best engineering practices like Test Driven Development, code reviews, Continuous Integration/Continuous Delivery for data pipelines.\n• Hire, train, coach, and evaluate the performance of the software engineering team, developing their skills and career growth.\n• Being a team player who can build relationships and collaborate productively with other teams across a variety of domains.\n• Champion culture of inclusivity and diversity\n\nAbout us\n\nLike the modern Britain we serve, we’re evolving. Investing billions in our people, data and tech to transform the way we meet the ever-changing needs of our 26 million customers. We’re growing with purpose. Join us on our journey and you will too…\n\nSpecifically, we are looking for people who have….\n\nWe understand no one can be an expert in every aspect of Data Engineering. However, if you have coding or scripting knowledge / experience with a data engineering background, we would like to hear from you.\n• Proven experience in software engineering, with experience in a leadership role.\n• Bachelor’s degree or higher in computer science, software engineering, or a related field.\n• Hands-on proven experience of delivering systems design, software development, testing and operational stability.\n• Proven experience and knowledge of automation and CI/CD\n• Advanced knowledge of agile methodologies.\n• Best practice coding/scripting experience developed in a commercial/industry setting (Python, SQL, Java, Scala or Go).\n• Working experience with operational data stores, data warehouse, big data technologies and data lakes (Teradata DW, BigQuery)\n• Experience working with relational and non-relational databases to build data solutions, such as SQL Server/Oracle/Teradata, experience with relational and dimensional data structures.\n• Experience in using distributed frameworks (Spark, Flink, Beam, Hadoop)\n• Practical experience of Cloud native solutions, specially GCP\n• Advanced knowledge of containers (Docker, Kubernetes)\n• Strong experience working with Kafka technologies.\n• Computer science fundamentals: a clear understanding of data structures, algorithms, software design, design patterns and core programming concepts.\n• Good understating of cloud storage, networking, and resource provisioning\n• Experience of hiring and recognising and developing talents\n\nOur focus is to ensure we are inclusive every day, building an organisation that reflects modern society and celebrates diversity in all its forms.\n\nWe want our people to feel that they belong and can be their best, regardless of background, identity, or culture. We were one of the first major organisations to set goals on diversity in senior roles, create a menopause health package, and a dedicated Working with Cancer initiative. And it is why we especially welcome applications from under-represented groups. We are disability confident. So, if you would like reasonable adjustments to be made to our recruitment processes, just let us know.\n\nWe also offer a wide-ranging benefits package, which includes:\n• A generous pension contribution of up to 15%\n• An annual performance-related bonus\n• Share schemes including free shares.\n• Benefits you can adapt to your lifestyle, such as discounted shopping.\n• 30 days’ holiday, with bank holidays on top\n• A range of wellbeing initiatives and generous parental leave policies\n\nIf you are excited by the thought of becoming part of our Data Engineering team, get in touch. We would love to hear from you.\n\nJoin our journey.\n\nAt Lloyds Banking Group, we're driven by a clear purpose; to help Britain prosper. Across the Group, our colleagues are focused on making a difference to customers, businesses and communities. With us you'll have a key role to play in shaping the financial services of the future, whilst the scale and reach of our Group means you'll have many opportunities to learn, grow and develop.\n\nWe keep your data safe. So, we'll only ever ask you to provide confidential or sensitive information once you have formally been invited along to an interview or accepted a verbal offer to join us which is when we run our background checks. We'll always explain what we need and why, with any request coming from a trusted Lloyds Banking Group person.\n\nWe're focused on creating a values-led culture and are committed to building a workforce which reflects the diversity of the customers and communities we serve. Together we’re building a truly inclusive workplace where all of our colleagues have the opportunity to make a real difference.", "job_is_remote": false, "job_posted_at_timestamp": 1703116800, "job_posted_at_datetime_utc": "2023-12-21T00:00:00.000Z", "job_city": "Bristol", "job_state": null, "job_country": "GB", "job_latitude": 51.454514, "job_longitude": -2.58791, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=AcnsNsFXnD7snNKnAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-04T11:42:59.000Z", "job_offer_expiration_timestamp": 1704368579, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": true, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineering", "job_posting_language": "en", "job_onet_soc": "11302100", "job_onet_job_zone": "4", "job_naics_code": "522110", "job_naics_name": "Commercial Banking"}, {"employer_name": "AutoProtect", "employer_logo": "https://images.crunchbase.com/image/upload/c_lpad,f_auto,q_auto:eco,dpr_1/v1397187447/1338baf938f8773ad8cd8f66053d5a73.png", "employer_website": "http://www.autoprotect.co.uk", "employer_company_type": null, "job_publisher": "BeBee", "job_id": "IZvWg-o82OfGOfHIAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Senior Engineer, Data Engineering", "job_apply_link": "https://gb.bebee.com/job/20231221-ce03e3afb00da61a00fd9ded937e9b34", "job_apply_is_direct": false, "job_apply_quality_score": 0.5057, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-ce03e3afb00da61a00fd9ded937e9b34", "is_direct": false}], "job_description": "We're embarking on an exciting journey here at AutoProtect, and we're on the lookout for a highly skilled and motivated Data Engineer to join our team and play a pivotal role in our data-driven journey.\n\nYou'll be an integral part of our central team, tasked with enhancing our data lake by incorporating new data sources, generating insightful reports, and streamlining essential processes.\nParticipate in efforts to design, build, and develop rapid proof-of-concept (PoC) data solutions and services.\n• Build data queries and pipelines using PySpark/Python, SQL (T-SQL/ANSI-SQL), Databricks and AWS (Athena, Glue, S3).\n• Be aware of the overall company data strategy.\n• Work with stakeholders, both technical and non-technical to design, spec and build data pipelines, and manage key data models and assets.\n• Be able to translate business requirements into clear and actionable pipeline changes that will help the business improve its data assets, data quality to help drive strategic direction.\n• Contributed to the exploration and understanding of new tools and techniques, and propose improvements to the data pipelines.\n• Has the ability to work with various data modelling techniques and strategies including Kimble/Inmon, Data-Mesh etc. Organised and able to prioritise work to meet deadlines and provide a high-quality output.\n• The right combination of communication skills and commercial awareness to manage the conflicting needs of different stakeholders. Experience in a similar or aligned role (Data Engineer/Data Analyst)\n• Experience with ETL and Data Warehousing methods and best practise\n• Experience of cloud data solutions (AWS, Google, Microsoft Azure), AWS preferred\n• Strong SQL or pySpark experience\n• Understanding of data flows between systems\n• Experience of supporting IT Applications and/or Platforms\n• Working knowledge and/or experience of building and maintaining datalakes/data-lakehouses in different tools (such as Databricks or Athena)\nKnowledge and experience of Financial Systems Support (Access Dimensions) or ServiceNow Support and Administration\n• Experience using Python or R\n\nIn this hybrid role, you will have the flexibility to work remotely while occasionally traveling to our offices in Leeds, Harlow, and London (London Liverpool Street), approximately once a week.\n\nIf you are passionate about data engineering and ready to contribute to our mission, we invite you to explore this exciting opportunity with us.\n\nOur award-winning customer journey supports our consumers with their claims and product admin, removing the friction from what can be a stressful time in our customers' lives.\n\niComply – our specialist compliance consultancy servicing the automotive sector\nan expert mobile vehicle repair network.\nDealTrak – our software platform dedicated to connecting automotive finance providers with their customers.\n\nWe work with vehicle retailers and manufacturers to bring award-winning protection, warranty and insurance products, easy-to-use finance and insurance platforms, and high-quality customer services, founded on FCA Treating Customers Fairly principles.\n\nWe sell products direct to our consumer via online sales channels at affordable price points.\n\nWith a small but efficient team, we remain agile enough to react to market demands and launch new products at the right time.\nNo agencies please.", "job_is_remote": false, "job_posted_at_timestamp": 1703146900, "job_posted_at_datetime_utc": "2023-12-21T08:21:40.000Z", "job_city": "Harlow", "job_state": null, "job_country": "GB", "job_latitude": 51.767788, "job_longitude": 0.087806, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=IZvWg-o82OfGOfHIAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": true}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Senior engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "CareerAddict", "employer_logo": "https://lookaside.fbsbx.com/lookaside/crawler/media/?media_id=100064536078638", "employer_website": "https://www.careeraddict.com", "employer_company_type": null, "job_publisher": "LinkedIn", "job_id": "2M4hgqm1Tl3PUr3DAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Lead Data Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/lead-data-engineer-at-careeraddict-3789082147", "job_apply_is_direct": false, "job_apply_quality_score": 0.7017, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/lead-data-engineer-at-careeraddict-3789082147", "is_direct": false}], "job_description": "(Fully Remote)\n\nUp to£80KDOE\n\nI am working with a client who are at the forefront of technology within their respected field. They provide end-to-end solutions for healthcare on a global scale. Due to continued growth, they are looking for a Technical Leader to help drive direction and take ownership.\n\nThis role is fully remote.\n\nRequirements\n• Track record in Lead Level Data Engineering focused position\n• Strong core understanding of Python& associated libraries\n• Strong core understanding of AWS (inclusive of services such as Lambda, SQS, EC2 etc.)\n\nDesirables\n• Machine Learning\n• Snowflake (Data Engineering)\n• BS or MS in Computer/Data Science or related degrees\n\nIf interested, please call Joseph Lusingu or send an updated CV to (see below)\n\nAs a professional company, we gladly welcome applications from persons of any age and background and do not intend to discriminate with advert text and terminology.", "job_is_remote": true, "job_posted_at_timestamp": 1703109574, "job_posted_at_datetime_utc": "2023-12-20T21:59:34.000Z", "job_city": "Antrim", "job_state": null, "job_country": "GB", "job_latitude": 54.719532, "job_longitude": -6.2072496, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=2M4hgqm1Tl3PUr3DAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T21:59:35.000Z", "job_offer_expiration_timestamp": 1705701575, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": false, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": true, "degree_preferred": true, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": 75000, "job_max_salary": 80000, "job_salary_currency": "GBP", "job_salary_period": "YEAR", "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "Harnham", "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRVe_fOHoStsP6B-Qug-A12f8Flt-BVqeJVITDW&s=0", "employer_website": "http://harnham.com", "employer_company_type": null, "job_publisher": "BeBee", "job_id": "_s8H-0qmcK_kPr6FAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Data Engineer", "job_apply_link": "https://gb.bebee.com/job/20231221-0765c85480a21cbe93f697009f830ce9", "job_apply_is_direct": false, "job_apply_quality_score": 0.516, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-0765c85480a21cbe93f697009f830ce9", "is_direct": false}, {"publisher": "Jooble", "apply_link": "https://uk.jooble.org/jdp/2115212618603253557/Data-Engineer-United-Kingdom", "is_direct": false}, {"publisher": "Recruit.net", "apply_link": "https://www.recruit.net/job/data-engineer-jobs/49D7DEB15881A82C", "is_direct": false}], "job_description": "Data Engineer- SQL Server, Cloud, ETL\n\nRemote/Hybrid - London Based\n\nUp to £60,000\n\nI am working on a Data Engineer role for an organisation investing in renewable energy sources.\n\nRequirements\n\nTo qualify for this Data Engineer role, you will require:\n• Strong SQL Server Experience\n• ETL\n• Azure - (DataBricks, DataFactory)\n\nSalary\n\nA successful candidate will receive:\n• A Salary of up to £60,000\n• Excellent progression opportunities\n\nProcess- three interview stages\n\n1st Stage- Short Conversation with the hiring manager\n\n2nd Stage- Technical Interview with Manager and Stakeholder\n\nHOW TO APPLY:\n\nPlease register your interest in this Data Engineer role by applying via this website. For more information on this role or other roles in the Business Intelligence market, reach out to Kathryn Self at Harnham.", "job_is_remote": false, "job_posted_at_timestamp": 1703161421, "job_posted_at_datetime_utc": "2023-12-21T12:23:41.000Z", "job_city": null, "job_state": null, "job_country": "GB", "job_latitude": 55.37805, "job_longitude": -3.435973, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=_s8H-0qmcK_kPr6FAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "Energy Jobline", "employer_logo": "https://www.energyjobline.com/sites/all/themes/ejl/logo.png", "employer_website": "http://energyjobline.com", "employer_company_type": null, "job_publisher": "LinkedIn", "job_id": "WchwSx3OPQEhfY3FAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Data Engineering Consultant in Lichfield, UK", "job_apply_link": "https://uk.linkedin.com/jobs/view/data-engineering-consultant-in-lichfield-uk-at-energy-jobline-3789277419", "job_apply_is_direct": false, "job_apply_quality_score": 0.7184, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/data-engineering-consultant-in-lichfield-uk-at-energy-jobline-3789277419", "is_direct": false}, {"publisher": "Energy Jobline", "apply_link": "https://www.energyjobline.com/job/data-engineering-consultant-lichfield-uk-19055696", "is_direct": false}], "job_description": "We are looking for a Data Engineering Consultant\n\nEnergy Jobline would like to introduce the role of Data Engineering Consultant based in Lichfield, UK. If you think you are a suitable match for this role, please hit the apply button for more details.\n\nData Engineering Consultant Location: Lichfield Salary: £40,000-£80,000 On-Site About The Company: With our expertise in data analytics, data management, data architecture, data tool etc, we help ...\n\nPLEASE NOTE: This job is supplied by a trusted partner. In order to read the full job description please click the 'apply' button. If you are a registered site member with an uploaded CV, you will be passed straight through. If not, then you will be asked to register a free account with us.", "job_is_remote": false, "job_posted_at_timestamp": 1703150306, "job_posted_at_datetime_utc": "2023-12-21T09:18:26.000Z", "job_city": "Lichfield", "job_state": null, "job_country": "GB", "job_latitude": 52.681602, "job_longitude": -1.831672, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=WchwSx3OPQEhfY3FAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-20T09:18:27.000Z", "job_offer_expiration_timestamp": 1705742307, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": false, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Consultant", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "STK Recruitment", "employer_logo": null, "employer_website": null, "employer_company_type": null, "job_publisher": "BeBee", "job_id": "jVyZiJFNGH2-5t15AAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Data Engineer", "job_apply_link": "https://gb.bebee.com/job/20231221-5a6126ef3f9b6e589e305b3e6969c66a", "job_apply_is_direct": false, "job_apply_quality_score": 0.518, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-5a6126ef3f9b6e589e305b3e6969c66a", "is_direct": false}, {"publisher": "Jooble", "apply_link": "https://uk.jooble.org/jdp/502303784035502874/Data-Engineer-Bedford%2C-Bedfordshire", "is_direct": false}], "job_description": "Job title: Data Engineer Do you have the right skills and experience for this role Read on to find out, and make your application.\n\nLocation: Hybrid / Bedford\n\nSalary: £60,000 per annum + 20% Bonus + double-match pension contributions up to 10%\n\nStandard hours: Monday to Friday 8am-4.30pm / 9am-5.30pm\n\nBenefits: 25 days holiday + statutory holiday\n\nRole:\n\nWe are assisting a successful well-established organisation who are searching for a talented Data Engineer to join a newly created department.\nThey are ju Please click on the apply button to read the full job description", "job_is_remote": false, "job_posted_at_timestamp": 1703161390, "job_posted_at_datetime_utc": "2023-12-21T12:23:10.000Z", "job_city": "Bedford", "job_state": null, "job_country": "GB", "job_latitude": 52.138638, "job_longitude": -0.4667782, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=jVyZiJFNGH2-5t15AAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "Bupa", "employer_logo": "http://www.bupa.co.uk/Assets/Global/Components/css/img/icon/logo.png", "employer_website": "http://www.bupa.co.uk", "employer_company_type": "Health Care", "job_publisher": "LinkedIn", "job_id": "kvr_lRf1eGhHeQiBAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Junior Data Modeller / Data Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/junior-data-modeller-data-engineer-at-bupa-3785075865", "job_apply_is_direct": false, "job_apply_quality_score": 0.6819, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/junior-data-modeller-data-engineer-at-bupa-3785075865", "is_direct": false}, {"publisher": "Glassdoor", "apply_link": "https://www.glassdoor.co.uk/job-listing/data-modeller-data-engineer-bupa-JV_KO0,27_KE28,32.htm?jl=1008865738093", "is_direct": false}], "job_description": "Job Description\n\nJunior Data Modeller / Data Engineer\n\nHybrid working / flexible\n\nManchester (M50 3SP)\n\nPermanent\n\n£36,900 - £42,000 per annum, depending on experience\n\nAnnual performance based bonus + benefits\n\nFull-time – 37.5 hours per week\n\nAt Bupa, we’re passionate about technology. With colleagues, customers, patients and residents in mind you’ll have the opportunity to work on innovative projects and make a real impact on their lives.\n\nRight from the start you’ll become part of our digital strategy, joining us on our journey and developing yourself along the way.\n\nHow You’ll Help Us Make Health Happen\n\nAs Junior Data Modeller, you will:\n• Build and hone skills in developing data pipelines and data models to facilitate the Bupa Enterprise Data Platform and meeting internal customer requirements.\n• Design T/SQL routines that adhere to an enterprise data & information architecture.\n• Create data marts from scratch (with assistance) along the entire data chain: implementing data modelling, error-handling, automated MDM procedures, data to hardware optimisation, etc.\n• Take ownership for resolving all data and information queries through to the source for our Customers.\n• Review personal workloads and analyse requirements. Facilitate the development of effective BI requirements through a solid understanding of modern Enterprise Data Platform (EDP), techniques, and best practices.\n• Evaluate data quality, consistency, and adherence to standards.\n• Aide the construction of the Enterprise Data Platform requirements through a solid understanding of modern EDW tools, techniques, and best practices.\n\nKey Skills / Qualifications Needed For This Role\n• Experience within the context of enterprise data warehouse (EDW) analysis and design, with partial knowledge of data warehouse methodologies and data modelling.\n• Data Vault 2.0 would be advantageous but not essential.\n• Experience with Microsoft SQL Server 2017 or later including developing stored procedure based ETL/ELT, proficiency with Visual Studio 2017 or later.\n• Experience with Snowflake would be advantageous.\n• Exposure to Hands-on knowledge of enterprise repository tools, data modelling tools, data mapping tools, and data profiling tools.\n• Experience with business requirements analysis, entity relationship diagramming, database design (both 3NF & Dimensional), reporting structures, etc.\n• Moderate technical experience with the MS BI technology stack.\n• Manages own time and allocations, with enthusiasm, following the UKMU IT strategic direction.\n• Resilience in an unpredictable environment where work levels can rapidly change.\n\nBenefits\n\nOur benefits are designed to make health happen for our people. Viva is our global wellbeing programme and includes all aspects of our health – from mental and physical, to financial, social and environmental wellbeing. We support flexible working and have a range of family friendly benefits.\n\nJoining Bupa in this role you will receive the following benefits and more:\n• 25 days holiday, increasing through length of service, with option to buy or sell\n• Bupa health insurance as a benefit in kind\n• An enhanced pension plan and life insurance\n• Annual performance-based bonus\n• Onsite gyms or local discounts where no onsite gym available\n• Various other benefits and online discounts\n\nWhy Bupa?\n\nWe’re a health insurer and provider. With no shareholders, our customers are our focus. Our people are all driven by the same purpose – helping people live longer, healthier, happier lives and making a better world. We make health happen by being brave, caring and responsible in everything we do.\n\nWe encourage all of our people to “Be you at Bupa”, we champion diversity, and we understand the importance of our people representing the communities and customers we serve. That’s why we especially encourage applications from people with diverse backgrounds and experiences.\n\nAs a Disability Confident employer, we offer a guaranteed interview for every disabled applicant who meets the minimum criteria for the job. We’ll make sure you are treated fairly and offer reasonable adjustments as part of our recruitment process to anyone that needs them.\n\nIf you would like more information on the role, require an alternative format, or would like to discuss other opportunities suited to your skills and experience, please contact the recruiter.\n\nTime Type\n\nFull time\n\nJob Area\n\nIT\n\nLocations:\n\nBupa Place, Staines - Willow House", "job_is_remote": false, "job_posted_at_timestamp": 1703103439, "job_posted_at_datetime_utc": "2023-12-20T20:17:19.000Z", "job_city": null, "job_state": null, "job_country": "GB", "job_latitude": 55.37805, "job_longitude": -3.435973, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=kvr_lRf1eGhHeQiBAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T20:17:20.000Z", "job_offer_expiration_timestamp": 1705695440, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Modeller", "job_posting_language": "en", "job_onet_soc": "15114100", "job_onet_job_zone": "4", "job_naics_code": "622110", "job_naics_name": "General Medical and Surgical Hospitals"}, {"employer_name": "St. James's Place", "employer_logo": "https://www.sjp.co.uk/sites/sjp-corp/files/logos/SJP_Logo_RGB_NEG_0.svg", "employer_website": "http://www.sjp.co.uk", "employer_company_type": "Finance", "job_publisher": "BeBee", "job_id": "swdAyPYuUuBZu-VvAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Senior Data Engineer", "job_apply_link": "https://gb.bebee.com/job/20231220-a8a97ba67eadc14a58d1e4a0b5a6f219", "job_apply_is_direct": false, "job_apply_quality_score": 0.5112, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231220-a8a97ba67eadc14a58d1e4a0b5a6f219", "is_direct": false}, {"publisher": "Talent.com", "apply_link": "https://uk.talent.com/view?id=ddf1cbfc255a", "is_direct": false}], "job_description": "St. James's Place (SJP) works inpartnership to plan, grow and protect our clients' financial futures. Wedeliver personalised, face-to-face financial advice to our clients, who trustus to manage their money to reach their goals. We provide this service via thePartnership, a network of qualified, expert advisors. We put financialwellbeing and responsible business choices at the heart of everything we do. Webelieve in the value of difference and know that diverse teams can help usproblem solve and innovate for clients.\n\nWe look for people to join SJP to make animpact and to contribute to our culture which is based around long termrelationships, doing the right thing, and being the best version of ourselves.\n\nLocation: Cirencester Office\n\nWorkplace Type: Hybrid\n\nEmployment Type: 12 month Fixed-Term Contract\n\nSeniority: Mid-Senior Level\n\nWe are looking for an experienced and proactive Senior Data Engineer to join our Business Change Division. The Senior Data Engineer will share responsibility for the end-to-end delivery of all project-related data and infrastructure work from a Data Engineering perspective.\n\nThe role will involve planning, coordinating, crafting the design, development, testing, and implementation of data engineering developments and ensuring this aligns to both our Data Strategy and Corporate aims.\n\nIf you are a Data Engineer with a passion for technology, we would love you hear from you\n\nWhat you'll be doing?\n• Using your knowledge and expertise to drive solutions and resolve issues.\n• Ensuring changes to requirements of projects are handled effectively within assigned team.\n• Engage as early as possible with potential projects to help advise and inform the scope and objectives to ensure the full impact and implications on data are understood.\n• Owning the build of data streaming systems and optimising the code to ensure processes perform efficiently.\n• Ensure new projects are prioritised and initiated effectively and align with change control processes and organisational priorities.\n\nWho are we looking for?\n• Solid understanding and experience with SQL and/or Python\n• Experience in using Snowflake and Matillion\n• Strong skills in problem solving and root cause analysis.\n• Knowledge of data warehousing, data modelling, and data architecture\n• Good Interpersonal and communication skills, both written and verbal\n• Ability to communicate with stakeholders at levels.\n\nWhat's in it for you?\n• Non-Contributory Pension – 10% (increasing with length of service up to 15%) with further pension matching.\n• Parental leave – 6 months full pay\n• 28 days holiday entitlement plus bank holidays (based on full-time equivalent) with the option to buy up to an additional 5 days holiday\n\nFlexible Working\nWe know that everyone works best indifferent ways, at different times and in different environments. We haveintroduced a hybrid working policy to provide greater flexibility for part-timework, job-sharing, remote working, and flexibility on hours. Our people areencouraged to work in a flexible way that suits their lifestyle, so please askthe question and start a conversation\n\nResearch tells us that applicants(especially those from underrepresented groups) can be put off from applyingfor a role if they do not meet all the criteria or have been on an extendedcareer-break. If you think you would be a good match for this role and candemonstrate some transferable experience please apply, regardless of whetheryou tick every box.", "job_is_remote": false, "job_posted_at_timestamp": 1703097248, "job_posted_at_datetime_utc": "2023-12-20T18:34:08.000Z", "job_city": "Cirencester", "job_state": null, "job_country": "GB", "job_latitude": 51.718494, "job_longitude": -1.968243, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=10&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=swdAyPYuUuBZu-VvAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-28T00:00:00.000Z", "job_offer_expiration_timestamp": 1703721600, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4", "job_naics_code": "523920", "job_naics_name": "Portfolio Management"}, {"employer_name": "CareerAddict", "employer_logo": "https://lookaside.fbsbx.com/lookaside/crawler/media/?media_id=100064536078638", "employer_website": "https://www.careeraddict.com", "employer_company_type": null, "job_publisher": "LinkedIn", "job_id": "F06yDSqlXMM4PDWRAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Data Engineer, Informatica, Databricks", "job_apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-informatica-databricks-at-careeraddict-3789082116", "job_apply_is_direct": false, "job_apply_quality_score": 0.7017, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-informatica-databricks-at-careeraddict-3789082116", "is_direct": false}, {"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231205-cbce501ab38c98416ccb3c6ac978d221", "is_direct": false}], "job_description": "Liverpool/Hybrid\n\nCirca £90k + bonus + benefits\n\nDatabricks, Informatica, Azure\n\nLead/Senior Data Engineer is required by vibrant Insurance organisation. This is a key role within their data team that will see you help to drive forward challenging and exciting data initiatives.\n\nYou will help the organisation to implement what is needed to deliver strategic data platforms. This will include, but not limited to the end-to-end support for acquisition, organisation, integration, transformation and secure storage of mission-critical data.\n\nYou Will\n• Work closely in partnership with large system integrators to support the delivery of the programs that align to data strategy.\n• Work with one or more delivery teams on a given program to ensure requirements are obtained, work has been properly identified, and lead or support engineers in delivering the data products required as part of the programs.\n• Partner with both the business and technical team to ensure that solutions are aligned to the business needs and follow enterprise standards and guidelines.\n• Partner with data management and governance leads to ensure that projects are delivered at or under budget and follow all compliance, regulatory, and data quality requirements.\n\nKey Requirements\n• Significant experience and in-depth knowledge of data delivery and associated architecture principles, Datamodelling concepts, ETL procedures, and all steps of data production process\n• Prior experience in insurance and/or reinsurance in support of specialty lines is a plus, however not essential if you have the transferableDatabricks and Informatica experience\n• Extensive hands-on experience inInformatica IICS, ADF, Notebooks, Databricks, Delta Lake, Warehousing technologies and associated patterns, Cloud platforms - Azure preferred\n• Experience with on-prem and cloud versions of databases such as Oracle and SQL Server\n• Professional certifications in public cloud and tooling - Informatica and Azure are highly desired\n• Analyzes data requirements and provides data analysis techniques, and applies Datamodelling (including data vault) and data quality techniques to establish, modify or maintain data structures and their associated components in complex environments\n• Experience with Agile delivery frameworks/methodologies (eg Scrum, SAFe) and tools (ie Jira, Azure DevOps)\n• Demonstrate a proven track record of having implemented solutions using one or more agile methodologies in conjunction with a large system integration partner.\n• Experience with mass ingestion capabilities and cloud process flows, data quality and master data management\n• Understanding data related security challenges and tooling with specific technologies (eg Databricks)\n• Experience in migrating data and associated systems from on-prem to cloud environments\n• Consulting and collaborative working style creating a culture of accountability and sharing\n• Knowledge of advanced analytics (models, tools, etc.) and their operational support is a plus\n• All salaries are subject to experience*\n\nFor a full consultation on this role please contact Arc IT or email your CV to Arc IT Recruitment.", "job_is_remote": false, "job_posted_at_timestamp": 1703109480, "job_posted_at_datetime_utc": "2023-12-20T21:58:00.000Z", "job_city": null, "job_state": null, "job_country": "GB", "job_latitude": 55.37805, "job_longitude": -3.435973, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=F06yDSqlXMM4PDWRAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T21:58:06.000Z", "job_offer_expiration_timestamp": 1705701486, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": true}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": true}, "job_experience_in_place_of_education": false, "job_min_salary": 90000, "job_max_salary": 90000, "job_salary_currency": "GBP", "job_salary_period": "YEAR", "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113300", "job_onet_job_zone": "4"}, {"employer_name": "Maxwell Bond®", "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSN7LTCqjGv-leDvDu5nAEoBA8y3iS7mV4j_XaM&s=0", "employer_website": null, "employer_company_type": null, "job_publisher": "BeBee", "job_id": "TYp4YnXkYYRK4l23AAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Senior Engineer, Data Engineering", "job_apply_link": "https://gb.bebee.com/job/20231221-679ad148e610be10ab8e41df146e5a43", "job_apply_is_direct": false, "job_apply_quality_score": 0.5189, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-679ad148e610be10ab8e41df146e5a43", "is_direct": false}], "job_description": "Lead/ Senior Data Engineer\nNo Visa Sponsorship Provided\n\nI am currently partnering with a revolutionary fuel management company that are undergoing an exciting data transformation and they are seeking a Lead/Senior Data Engineer.\nThe successful Lead/ Senior Data Engineer will have:\n\n~3 years experience as a Data Engineer.\n~ Experienced in developing data ETL pipelines, setting up data warehouses and data lakes using AWS services.\n~ Strong knowledge of Python and SQL.\n~ Significant Bonus Package.\nFlexible working for work/life balance.\nPrivate healthcare package\nDiscounts package with retailers\n\nBy applying for this role, you provide us with consent to process your data in line with our Privacy Policy, full details can be found on our website.", "job_is_remote": false, "job_posted_at_timestamp": 1703161416, "job_posted_at_datetime_utc": "2023-12-21T12:23:36.000Z", "job_city": null, "job_state": null, "job_country": "GB", "job_latitude": 55.37805, "job_longitude": -3.435973, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=TYp4YnXkYYRK4l23AAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": 36, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Senior engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "EY", "employer_logo": "https://assets.ey.com/content/dam/ey-sites/ey-com/en_gl/generic/logos/20170526-EY-Digital-Brand.svg", "employer_website": "http://www.ey.com", "employer_company_type": "Accounting", "job_publisher": "LinkedIn", "job_id": "qUsMKU1Op2ISNXe0AAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Manager, Data Engineering, Belfast 1", "job_apply_link": "https://uk.linkedin.com/jobs/view/manager-data-engineering-belfast-1-at-ey-3790918521", "job_apply_is_direct": false, "job_apply_quality_score": 0.6949, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/manager-data-engineering-belfast-1-at-ey-3790918521", "is_direct": false}, {"publisher": "Indeed", "apply_link": "https://uk.indeed.com/viewjob?jk=aa20b9ed106fce8e", "is_direct": false}, {"publisher": "Ni Jobs", "apply_link": "https://www.nijobs.com/job/manager-data-engineering/ey-job101732123", "is_direct": false}, {"publisher": "Glassdoor", "apply_link": "https://www.glassdoor.co.uk/job-listing/manager-data-engineering-belfast-1-ey-JV_IC3304415_KO0,34_KE35,37.htm?jl=1009040102744", "is_direct": false}, {"publisher": "123work", "apply_link": "https://uk.123work.net/manager-data-analytics-belfast-9OnzLj5oq6", "is_direct": false}, {"publisher": "SimplyHired", "apply_link": "https://www.simplyhired.co.uk/job/xkZ6koNyBLVNV8GLjMSOuwCJyBd7aMSHtQLL7ko6lJw433WQPY0dhQ", "is_direct": false}, {"publisher": "Jora UK", "apply_link": "https://uk.jora.com/job/Manager-Data-Engineering-a01042f6ae3cc103666ee6a02f661ca2", "is_direct": false}], "job_description": "Data Analytics at EY\n\nData Analytics is one of the most exciting fields in today’s digital world. It offers challenging work, career development and great job satisfaction. EY’s mission is to build a better working world by asking better questions and finding better answers – this is what Data Analytics is all about. What better way to help us achieve our mission than by working with our Data Science teams as we continue on this journey.\n\nData Analytics is one of our strategic growth platforms with plans to grow from 150 people today to over 200 in the next 2-3 years. We are transforming our business by embedding analytics in everything we do. We are helping our clients transform their businesses by doing the same, across industry sectors and lines of business. We are growing and so are our people. We are hiring managers, experienced professionals and graduates to work in a variety of roles.\n\nApply today…\n\nManager\n\nWho are we?\n\nAt EY our purpose is to Build a Better Working World. We believe that the highest-performing teams maximize the power of different perspectives and backgrounds. It is important that these teams are both diverse and inclusive and are willing to learn from other perspectives. Our ability to include various viewpoints into our mindsets, behaviours and operations is fundamental in driving innovation, building strong relationships and delivering the best solutions for our clients.\n\nThe Opportunity\n\nIn response to strong market demand, we are seeking additional individuals to enhance our existing team. This is a fantastic opportunity to contribute to the Data Analytics team who are not only changing how we deliver services to our clients but are also committed to creating a diverse environment where EY people are valued, where they feel they belong and can contribute their best in every encounter.\n\nYour Role And Responsibilities\n• Helping clients unlock value from their information assets through collaboration with domain experts and by embedding innovative data analytics solutions in existing services lines\n• Leading diverse teams with varying skillsets, who use different Data and Analytics technologies.\n• Ability to adapt your leadership style to fit team, client and cultural needs\n• Working in multi-disciplinary teams across a range of industries helping our clients, using our analytics to transform and improve their business\n• A passion to contribute to the growth of the team, bringing energy, enthusiasm, and the courage to lead and develop others\n• Drawing on your knowledge and experience, driving innovative insights which will add value to both our clients and to the broader society,\n• Contributing to the development of the wider Data & Analytics team’s future by building our brand, attending relevant events, collaborating with other internal teams, etc\n• With guidance from partners, directors, and senior managers, you’ll identify and act on potential business opportunities for EY\n\nSkills And Attributes For Success\n• The following list provides examples of skills and attributes that would help you be successful in the Data and Analytics team at EY\n• Relevant experience in consulting or industry with proven management experience\n• Demonstrate the ability to supervise and develop others, effectively communicate, budgets, managing client expectations, delivering quality projects, timelines, etc.\n• Ability to communicate technical information to non-technical colleagues and clients\n• Ambition to continuously develop your skills and abilities\n• Analytically minded and have the ability to assimilate and apply new techniques and knowledge, to deliver insights and solve problems\n• Professional with ability to work in diverse, evolving, and dynamic client environments\n• Experience in all aspects of the data lifecycle, for example:\n• Data Strategy\n• Data Manipulation and ETL\n• Master Data Management\n• Data Models and Visualization\n• A completed degree (bachelors, masters, or PhD)\n\nWhat We Offer\n\nWe offer a competitive remuneration package where you’ll be rewarded for your individual and team performance. Our comprehensive Total Rewards package includes support for flexible working and career development, and with FlexEY you can select benefits that suit your needs, covering holidays, health and well-being, insurance, savings and a wide range of discounts, offers and promotions.\n\nContinuous learning:\n• You’ll develop the mindset and skills to navigate whatever comes next.\n• As you grow and develop here, you’ll discover opportunities to help customise your career journey, so that it’s as unique as you are.\n\nSuccess as defined by you:\n• We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.\n• We have embraced Hybrid working at EY adding greater flexibility and autonomy to the roles of our employees\n\nTransformative leadership:\n• We’ll give you the insights, coaching and confidence to be the leader the world needs.\n\nDiverse and inclusive culture:\n• Diversity is about differences. You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\n• CIPD 2020 Diversity and Inclusion Winner, GreatPlaceToWork’s Top 20 UK’s Best Workplaces for Women 2020 (Super Large Category) And Times Top 50 Employers for Women 2019 & 2020\n\nTo hear stories from professionals within our business around their experience, career advice and progression, and belonging and flexibility please visit us here\n\nIf you can demonstrate that you meet the criteria above, please contact us as soon as possible.\n\nThe Exceptional EY Experience. It’s Yours To Build.\n\nApply now.\n\nEY | Building a better working world\n\n \n\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\n\n \n\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\n\n \n\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.", "job_is_remote": false, "job_posted_at_timestamp": 1703107490, "job_posted_at_datetime_utc": "2023-12-20T21:24:50.000Z", "job_city": "Belfast", "job_state": null, "job_country": "GB", "job_latitude": 54.597286, "job_longitude": -5.93012, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=qUsMKU1Op2ISNXe0AAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T21:24:50.000Z", "job_offer_expiration_timestamp": 1705699490, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": true, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Manager", "job_posting_language": "en", "job_onet_soc": "11302100", "job_onet_job_zone": "4", "job_naics_code": "54121", "job_naics_name": "Accounting, Tax Preparation, Bookkeeping, and Payroll Services"}, {"employer_name": "Snaphunt", "employer_logo": "https://images.snaphunt.com/assets/vectors/icons/logo3.svg", "employer_website": "http://snaphunt.com", "employer_company_type": null, "job_publisher": "BeBee", "job_id": "z3Huqeyoj-GF14iJAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Azure Data Engineer", "job_apply_link": "https://gb.bebee.com/job/20231221-2552bd40ffb33522d81d587f32fab461", "job_apply_is_direct": false, "job_apply_quality_score": 0.4873, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-2552bd40ffb33522d81d587f32fab461", "is_direct": false}, {"publisher": "Talent.com", "apply_link": "https://uk.talent.com/view?id=eb8e9725bc55", "is_direct": false}], "job_description": "The Offer\n• Individual training budget and exam fees for partner certifications\n• Flexible working hours and hybrid working model\n• Laptop and equipment of your choice\n• Local package such as up to 7% matched pension contributions, extensive private health care, Bupa dental plan, and a seasonal ticket loan, enhanced maternity and parental leave, gym expense or well-being monthly and mobile phone allowance\n\nThe Job\n\nYour daily responsibilities:\n• Designing, architecting, and implementing modern cloud-based pipelines for our customers\n• Making data accessible and usable for a new wave of data-powered apps and services\n\nThe Profile\n\nYour key skills:\n• 3 years of professional programming experience and hands-on experience in building modern data platforms/pipelines\n• Knowledge of cloud platforms: Azure and thair data services\n• Programming languages skills: Python, Java, Scala,\n• Knowledge of frameworks: Spark/PySpark, Hadoop, Hive, Pig, Kafka\n• Familiarity with tools such as: Jupyter Notebooks, BI Tools\n• Databases: SQL, NoSQL, Relational databases (columnar & row-oriented), Graph databases\n• Data pipelining: ETL, ELT, Azure Data Factory\n• Analytycs: Synapse, Databricks\n• Consultancy experience\n• Previous experience gained in mid-size/large, international companies\n• Fluent communication skills in English\n\nWhat sets you apart (we'd consider any of these a big plus):\n• Interest in or experience with Machine Learning and Artificial Intelligence (e.g.: Azure AI Studio, Azure OpenAI, etc.)\n• Search engines: Azure AI Search (Cognitive Search), Elasticsearch, Solr\n\nThe Employer\n\nOur client is a European leader in cloud advisory, implementation, application development, managed services, and training.", "job_is_remote": false, "job_posted_at_timestamp": 1703141625, "job_posted_at_datetime_utc": "2023-12-21T06:53:45.000Z", "job_city": "Manchester", "job_state": null, "job_country": "GB", "job_latitude": 53.48076, "job_longitude": -2.2426305, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=z3Huqeyoj-GF14iJAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": 36, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": true}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "Places for People", "employer_logo": "https://media.licdn.com/dms/image/C4E0BAQGCe8Yqa3CpCQ/company-logo_200_200/0/1658231228823/placesforpeople_logo?e=2147483647&v=beta&t=MqAMiBpi60gfsTCZR3e8VEzdcXNWSghRYmyhwF6Hx8Y", "employer_website": "http://www.placesforpeople.co.uk", "employer_company_type": "Construction", "job_publisher": "LinkedIn", "job_id": "CjckvXAq9zPOBIqpAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Data Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-at-places-for-people-3775547651", "job_apply_is_direct": false, "job_apply_quality_score": 0.7525, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-at-places-for-people-3775547651", "is_direct": false}, {"publisher": "Glassdoor", "apply_link": "https://www.glassdoor.co.uk/job-listing/data-insight-analyst-places-for-people-JV_KO0,20_KE21,38.htm?jl=1009014617203", "is_direct": false}, {"publisher": "Indeed", "apply_link": "https://uk.indeed.com/viewjob?jk=7ae6cd41a644dcce", "is_direct": false}, {"publisher": "Workcircle UK", "apply_link": "https://www.workcircle.co.uk/fulljobdetails/1065541654/gfjy", "is_direct": false}], "job_description": "At Places for People, we hire People, not numbers! So, if you like the sound of one of our jobs, please apply - you could be just who we're looking for! Of course, experience and track record are important, but we're more interested in hiring someone that embodies our People Promises. That's someone that does the right thing, is enthusiastic and motivated to grow, believes in Community spirit, is respectful and enjoys their work. As the UK's leading Social Enterprise, we don't discriminate based on any protected attribute. In fact, we're dedicated to creating inclusive and thriving Communities for both our Customers and Employees.\n\nSo, what are you waiting for? Join a community that cares about you!\n\nMore About Your Role\n\nThe Group IT function has a critical role to play in supporting our commitment to put ‘People First' and to be a digital business. We aim to partner with the various business functions to proactively deliver innovative digital solutions. In addition, we are looking to create technology platforms that allow the Group to flex and operate in an environment in which the pace of change, often technology-driven, continues to increase enabling the Group to meet and exceed its strategic objectives ensuring that people are our first priority. \n\nAs a Data Engineer you will build, manage and optimise data pipelines, producing data in an easy-to-read customer focused format. You will be considered a blend of data and analytics “evangelist,” “data guru” and “fixer”.\n\nThis role will follow a Hybrid working patter and your time will be split between working from the Office and working from Home\n\nFor more information, please download our job profile available on our website.\n\nMore About You\n\nYou will have knowledge of Data and Analytics have worked with programming languages such as SQL and PL/SQL. Experience working with large, heterogeneous datasets in formats such as ETL, ELT, data replication, CDC, API design and access is required. You will have a background as a developer and a track record of working with GCP.\n\nThe Benefits\n\nWe are a large diverse and ambitious business, which will give you all the challenge you could wish for.\n\nWe know that there's always more we can do to make you smile, that's why we offer a comprehensive benefits package with each role, yours will include:\n• Competitive salary, with a salary review yearly\n• Pension with matched contributions up to 7%\n• Excellent holiday package – up to 35 days annual leave with the option to buy or sell leave\n• Essential car allowance to cover the wear and tear on your car for any travel associated with your role\n• Cashback plan for healthcare costs – up to £500 saving per year\n• A bonus scheme for all colleagues at 2%\n• Training and development\n• Extra perks including huge discounts and offers from shops, cinemas and much more\n\nWhat's next?\n\nIf you meet the criteria and are ready to make the next step in your career then apply following our simple 5 minute application process, upload a CV and a supporting statement which demonstrates how you meet the requirements of the role. If you have any questions please call the recruitment team on 01772 666555.\n\nIf you are a Places for People customer and you're looking for support with your application, please contact our skills and employment team on skillsemployment@placesforpeople.co.uk.\n\nPlease note that we may bring the closing date forward, if we receive a large number of quality applications. If you are interested in this role we would advise applying immediately to avoid disappointment.\n\nIf you are using a mobile device such as an iPad then ensure your CV is stored in the cloud, we currently support Google Drive, OneDrive and Dropbox.\n\nArmed Forces - We are proud to support the Armed Forces Covenant. Places for People will guarantee an interview for any candidate who has formerly served in the Armed Forces and who meets the essential criteria for the vacancy.\n\nDisability Confident - We are proud to be a member of the Disability Confident scheme certified as Level 2 Disability Confident Employer. This helps us to successfully employ and retain people with disabilities and health conditions. Disabled applicants who meet the essential criteria for a vacancy will be guaranteed an interview. The Equality Act 2010 (Disability Discrimination Act 1995 for NI) defines a disabled person as someone who has a physical or mental impairment that has sa substantial and long-term negative effect on their ability to do daily activities.\n\nNeurodivergent – Neurodiverse individuals have highly valuable skills, and we recognise that a traditional interview process sometimes works against them and doesn’t allow them to self-advocate. Neurodiverse applicants who meet the criteria for a vacancy will be guaranteed an interview.", "job_is_remote": false, "job_posted_at_timestamp": 1703161996, "job_posted_at_datetime_utc": "2023-12-21T12:33:16.000Z", "job_city": null, "job_state": null, "job_country": "GB", "job_latitude": 55.37805, "job_longitude": -3.435973, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=CjckvXAq9zPOBIqpAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-28T16:53:04.000Z", "job_offer_expiration_timestamp": 1706460784, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4", "job_naics_code": "237", "job_naics_name": "Heavy and Civil Engineering Construction"}, {"employer_name": "Snaphunt", "employer_logo": "https://images.snaphunt.com/assets/vectors/icons/logo3.svg", "employer_website": "http://snaphunt.com", "employer_company_type": null, "job_publisher": "BeBee", "job_id": "yh3xq_x8zDMhUovxAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Azure Data Engineer", "job_apply_link": "https://gb.bebee.com/job/20231221-29f3a0f10bceb05421c1713f4a9b3e65", "job_apply_is_direct": false, "job_apply_quality_score": 0.4873, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-29f3a0f10bceb05421c1713f4a9b3e65", "is_direct": false}, {"publisher": "Talent.com", "apply_link": "https://uk.talent.com/view?id=85ee4af8d12d", "is_direct": false}], "job_description": "The Offer\n• Individual training budget and exam fees for partner certifications\n• Flexible working hours and hybrid working model\n• Laptop and equipment of your choice\n• Local package such as up to 7% matched pension contributions, extensive private health care, Bupa dental plan, and a seasonal ticket loan, enhanced maternity and parental leave, gym expense or well-being monthly and mobile phone allowance\n\nThe Job\n\nYour daily responsibilities:\n• Designing, architecting, and implementing modern cloud-based pipelines for our customers\n• Making data accessible and usable for a new wave of data-powered apps and services\n\nThe Profile\n\nYour key skills:\n• 3 years of professional programming experience and hands-on experience in building modern data platforms/pipelines\n• Knowledge of cloud platforms: Azure and thair data services\n• Programming languages skills: Python, Java, Scala,\n• Knowledge of frameworks: Spark/PySpark, Hadoop, Hive, Pig, Kafka\n• Familiarity with tools such as: Jupyter Notebooks, BI Tools\n• Databases: SQL, NoSQL, Relational databases (columnar & row-oriented), Graph databases\n• Data pipelining: ETL, ELT, Azure Data Factory\n• Analytycs: Synapse, Databricks\n• Consultancy experience\n• Previous experience gained in mid-size/large, international companies\n• Fluent communication skills in English\n\nWhat sets you apart (we'd consider any of these a big plus):\n• Interest in or experience with Machine Learning and Artificial Intelligence (e.g.: Azure AI Studio, Azure OpenAI, etc.)\n• Search engines: Azure AI Search (Cognitive Search), Elasticsearch, Solr\n\nThe Employer\n\nOur client is a European leader in cloud advisory, implementation, application development, managed services, and training.", "job_is_remote": false, "job_posted_at_timestamp": 1703141592, "job_posted_at_datetime_utc": "2023-12-21T06:53:12.000Z", "job_city": "London", "job_state": null, "job_country": "GB", "job_latitude": 51.507217, "job_longitude": -0.1275862, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=yh3xq_x8zDMhUovxAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": 36, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": true}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "EY", "employer_logo": "https://assets.ey.com/content/dam/ey-sites/ey-com/en_gl/generic/logos/20170526-EY-Digital-Brand.svg", "employer_website": "http://www.ey.com", "employer_company_type": "Accounting", "job_publisher": "BeBee", "job_id": "0uVATdJvTDK5Zw9aAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Manager, Data Engineering, Belfast 1", "job_apply_link": "https://gb.bebee.com/job/20231221-8a4c595b8e1d3569742de95f443b6fc8", "job_apply_is_direct": false, "job_apply_quality_score": 0.4942, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-8a4c595b8e1d3569742de95f443b6fc8", "is_direct": false}], "job_description": "Data Analytics at EY\n\nData Analytics is one of the most exciting fields in today's digital world. It offers challenging work, career development and great job satisfaction. EY's mission is to build a better working world by asking better questions and finding better answers – this is what Data Analytics is all about. What better way to help us achieve our mission than by working with our Data Science teams as we continue on this journey.\n\nData Analytics is one of our strategic growth platforms with plans to grow from 150 people today to over 200 in the next 2-3 years. We are transforming our business by embedding analytics in everything we do. We are helping our clients transform their businesses by doing the same, across industry sectors and lines of business. We are growing and so are our people. We are hiring managers, experienced professionals and graduates to work in a variety of roles.\n\nApply today...\n\nManager\n\nWho are we?\nAt EY our purpose is to Build a Better Working World. We believe that the highest-performing teams maximize the power of different perspectives and backgrounds. It is important that these teams are both diverse and inclusive and are willing to learn from other perspectives. Our ability to include various viewpoints into our mindsets, behaviours and operations is fundamental in driving innovation, building strong relationships and delivering the best solutions for our clients.\n\nThe Opportunity\nIn response to strong market demand, we are seeking additional individuals to enhance our existing team. This is a fantastic opportunity to contribute to the Data Analytics team who are not only changing how we deliver services to our clients but are also committed to creating a diverse environment where EY people are valued, where they feel they belong and can contribute their best in every encounter.\n\nYour Role and Responsibilities\n• Helping clients unlock value from their information assets through collaboration with domain experts and by embedding innovative data analytics solutions in existing services lines", "job_is_remote": false, "job_posted_at_timestamp": 1703126798, "job_posted_at_datetime_utc": "2023-12-21T02:46:38.000Z", "job_city": "Belfast", "job_state": null, "job_country": "GB", "job_latitude": 54.597286, "job_longitude": -5.93012, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=0uVATdJvTDK5Zw9aAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Manager", "job_posting_language": "en", "job_onet_soc": "11302100", "job_onet_job_zone": "4", "job_naics_code": "54121", "job_naics_name": "Accounting, Tax Preparation, Bookkeeping, and Payroll Services"}, {"employer_name": "Salt", "employer_logo": null, "employer_website": null, "employer_company_type": null, "job_publisher": "Learn4Good", "job_id": "meIT-QiPHFtnywycAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Machine Learning Engineer", "job_apply_link": "https://www.learn4good.com/jobs/online_remote/software_development/2780724506/e/", "job_apply_is_direct": false, "job_apply_quality_score": 0.4619, "apply_options": [{"publisher": "Learn4Good", "apply_link": "https://www.learn4good.com/jobs/online_remote/software_development/2780724506/e/", "is_direct": false}], "job_description": "A Global leading company is currently recruiting for an Machine Learning/ Azure Data Engineer that has experience with Azure data Lake, Data Bricks, Azure and Active Directory. Remote position anywhere in - Paying up to £800 per day.\n• Experience and skills required for the Machine Learning/ Azure Data Engineer, Azure Engineer, Azure Data Lake, Azure data Factory, Azure Dev Ops, Data Bricks, Python/Scala, Azure Active Directory Azure Data Lake Data Bricks Azure data Factory Azure Dev Ops Python/Scala Knowledge on Access control lists and\n• Azure Active Directory Package for the for the Azure Data Engineer, Azure Engineer, Azure Data Lake, Azure data Factory, Azure Dev Ops, Data Bricks, Python/Scala, Azure Active Directory · £800 per day", "job_is_remote": true, "job_posted_at_timestamp": 1703116800, "job_posted_at_datetime_utc": "2023-12-21T00:00:00.000Z", "job_city": null, "job_state": null, "job_country": "GB", "job_latitude": 55.37805, "job_longitude": -3.435973, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=meIT-QiPHFtnywycAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-06-20T00:00:00.000Z", "job_offer_expiration_timestamp": 1718841600, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": 800, "job_max_salary": 800, "job_salary_currency": "GBP", "job_salary_period": "DAY", "job_highlights": {}, "job_job_title": "Learning engineer", "job_posting_language": "en", "job_onet_soc": "15111100", "job_onet_job_zone": "5", "job_occupational_categories": ["Azure", "Data Engineer", "Python", "DevOps"]}, {"employer_name": "HSO", "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSW3ylEqCTPM2oo_CdG6hn_KtvS39P-woM2bJ32&s=0", "employer_website": null, "employer_company_type": null, "job_publisher": "BeBee", "job_id": "FihqCRCq3TXoeWMyAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Senior Azure Data Engineer", "job_apply_link": "https://gb.bebee.com/job/20231221-6b27f25c5c173343da2655c27c806214", "job_apply_is_direct": false, "job_apply_quality_score": 0.516, "apply_options": [{"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231221-6b27f25c5c173343da2655c27c806214", "is_direct": false}], "job_description": "HSO is a leading Microsoft Dynamics Gold partner, founded in 1987 specialising in sectors such as Retail, Rental, Manufacturing, Professional Services and Local Government.\n\nWith a head count of over 400 employees in the UK, winning multiple awards such as 2020 Microsoft Partner of the Year, Best Tech company 2021 and Top 3 Large Companies to work for 2021 our reputation in the Dynamics Market is higher than ever.\n\nEnsuring our employees are challenged, supported and engaged in our wider family is key to our continued success - we have a designated Learning and Development Team who are continuously offering the best training on the market, combined with an Engagement Team who are creative in ways we can have social activities virtually.\nFrom online chess tournaments to coffee mornings, to Netflix and book clubs, virtual singing classes, online yoga - the list is endless\n\nAs the digital transformation revolution gathers pace, there is a growing need to provide our customers with capabilities that extend beyond a knowledge of ERP and its traditional implementation.\nWe have a number of growing service lines, one of which is Data & Analytics. This role is to join this growing team, designing and developing modern data platforms for our customers.\n\nAs a Data Engineer, you will be working collaboratively within an agile delivery team to design and develop BI and data platform solutions in Azure.\nData & Analytics Team Lead\nTo lead in Data Analytics projects focused on HSO Customers including all elements of the BI project lifecycle\nTo be productive in the development / delivery of BI elements whether these are reports, cubes & dashboards\nTo provide training and internal support to HSO Technical, Consulting and Presales resources with regard to Data & Analytics technologies\nTo maintain and work within the company standards and process, designed to give traceability, accountability and maintain a high level of quality\nCustomer-centric - able to operate/influence at senior board level\nOrganised, detailed and able to translate contract SLA's and customer requirements into working documentation\nFacilitation - consensus-building approach with the ability to quickly and effectively assimilate, structure and present back options and ideas to varied set of stakeholders\nExcellent communication skills including written, on the telephone and face to face\nPlanning and organising\nFlexible\nExcellence in core Microsoft Azure data engineering skills including Azure Data Factory, Azure Data Lake, Synapse Data flows#\nAzure database experience (Synapse, SQL Managed Instance, Azure SQL)\nStrong knowledge of BI integration\nStrong experience of Power BI (Power Query, DAX, Power BI Service)\nExperience in data extraction and migration\nExperience of the full BI Project Lifecycle\nGood English language skills both written and spoken\nPython\nMicrosoft AI\nMicrosoft Fabric\nDatabricks, or other data transformation technologies\nExposure to other Microsoft technologies\nParking and close to Public transport at Office locations\nHolidays\nPension\nDental\nLife Insurance", "job_is_remote": false, "job_posted_at_timestamp": 1703146902, "job_posted_at_datetime_utc": "2023-12-21T08:21:42.000Z", "job_city": "Reading", "job_state": null, "job_country": "GB", "job_latitude": 51.45512, "job_longitude": -0.9787475, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=20&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=FihqCRCq3TXoeWMyAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2023-12-29T00:00:00.000Z", "job_offer_expiration_timestamp": 1703808000, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Data engineer", "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "Principal IT", "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRMjfjJoxaGaS8nh9Y9HEbNKlH_rPMsTaev5i8p&s=0", "employer_website": null, "employer_company_type": null, "job_publisher": "LinkedIn", "job_id": "qkRNilHe6RDsrVkNAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "IT Field Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/it-field-engineer-at-principal-it-3789016680", "job_apply_is_direct": false, "job_apply_quality_score": 0.7494, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/it-field-engineer-at-principal-it-3789016680", "is_direct": false}, {"publisher": "Jooble", "apply_link": "https://uk.jooble.org/jdp/5757675260847658622/IT-Field-Engineer-Hessle%2C-East-Yorkshire", "is_direct": false}, {"publisher": "Talent.com", "apply_link": "https://uk.talent.com/view?id=5a3f281c21b5", "is_direct": false}, {"publisher": "Learn4Good", "apply_link": "https://www.learn4good.com/jobs/hessle/uk/info_technology/2780694286/e/", "is_direct": false}], "job_description": "IT Field Engineer - Hessle - £23,000 to £28,000\n\nPrincipal IT are working with a well established business based in Hessle. They are currently on the lookout for an IT Field Engineer to join them on a permanent basis. This business has seen rapid growth throughout the past few years and shows no signs of slowing down.\n\nTheir core focus is assisting their clients with achieving their business goals through relevant and forward-thinking technology solutions.\n\nTo be successful in this role they are looking for someone who can adapt to a variety of challenges, key areas are stated below -\n• Remote & On Site Maintenance of Customer Infrastructure\n• Working closely with the IT support desk to feedback site updates, planned Maintenance & support queries\n• Installation of hardware including laptops, printers, PCs, monitors, servers and racks\n• Keeping up to date with new technologies and products\n\nEssential Skills\n• Full UK driving license is essential\n• An interest in the world of IT and a hunger to learn\n• Experience in a similar IT support role is essential.\n• Excellent knowledge of IT products including Microsoft Windows Server, Core Infrastructure Server Hardware, Virtualisation, Exchange/Office 365.\n\nHow To Apply\n\nIf you are interested in hearing more about this IT Field Engineer position or interested in applying for the role please follow the link below or contact Principal IT Directly.", "job_is_remote": false, "job_posted_at_timestamp": 1703094793, "job_posted_at_datetime_utc": "2023-12-20T17:53:13.000Z", "job_city": "Hessle", "job_state": null, "job_country": "GB", "job_latitude": 53.723804, "job_longitude": -0.434858, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=qkRNilHe6RDsrVkNAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T17:53:14.000Z", "job_offer_expiration_timestamp": 1705686794, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Field engineer", "job_posting_language": "en", "job_onet_soc": "17219900", "job_onet_job_zone": "4"}, {"employer_name": "Alliance Healthcare", "employer_logo": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Alliance_Healthcare_logo.svg/800px-Alliance_Healthcare_logo.svg.png", "employer_website": "http://www.alliance-healthcare.com.tr", "employer_company_type": "Manufacturing", "job_publisher": "LinkedIn", "job_id": "CoMn27RKJH4NjU8zAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Visualisation Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/visualisation-engineer-at-alliance-healthcare-3789011085", "job_apply_is_direct": false, "job_apply_quality_score": 0.7659, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/visualisation-engineer-at-alliance-healthcare-3789011085", "is_direct": false}, {"publisher": "Jobijoba UK", "apply_link": "https://www.jobijoba.co.uk/detail/92/0352394e259c9c7b443045b397afe047", "is_direct": false}, {"publisher": "BeBee", "apply_link": "https://gb.bebee.com/job/20231220-fa5fb942de6e32c3124fd165a9d3e745", "is_direct": false}, {"publisher": "Getwork", "apply_link": "https://getwork.com/details/c1421c66910d80c5baa64b75d3245492", "is_direct": false}], "job_description": "About The Role\n\nWe are looking for a motivated and detail-oriented Visualization Engineer to be a part of delivering world-class dashboards and data visualisation capabilities at Alliance Healthcare.\n\nYou will be working with Data Engineers and Data Architects as part of a team to deliver incredible visual products to different business areas around the organisation along with analysts within the business functions to identify key value streams.\n\nKey Responsibilities\n\nTranslate business needs to technical solutions\n• Collaborate with stakeholders to gather requirements and ensure the delivered solutions meet their needs.\n• Work with solution architects to break down and estimate packages of work and contribute to design documents and review process\n\nManage the delivery and evolution of data visualisations\n• Work with 3rd party developers and other remote internal development teams to deliver robust solutions for data visualisations as agreed through intake process\n• Be the technical interface between data engineers, project management and the business in the delivery of projects and incremental change\n\nManage a suite of data visualisations\n• Optimize performance of BI applications by tuning queries, improving data processing pipelines, or recommending infrastructure changes.\n• Feed into the overall roadmap for data visualisation platforms taking into account Alliance Healthcare and the wider business strategy\n\nDeliver the service for the business\n• Assure appropriate processes and metrics are in place to run the platforms and solutions as part of a business-as-usual service. This will require working with other teams across the business who may provide platforms and other elements of the service\n• Troubleshoot issues related to data quality, report accuracy, or system performance.\n\nVisualisation Standards\n• Contribute and suggest additions and changes to standards for layout, style, coding, SQL and prototyping\n\nAbout You\n\nWe are looking for candidates with the following attributes:\n• A university degree or equivalent IT experience\n• Strong proficiency in PowerBI for building interactive reports and dashboards.\n• Experience with modern dashboarding platforms such as Power BI, Tableau, and Qlik\n• Familiarity with principles of data visualization from E. Tufte, S. Few or similar.\n• Knowledge of Cognos for enterprise reporting and analytics is a plus.\n• Solid understanding of SQL queries for retrieving and manipulating data from relational databases.\n• Python experience is desirable.\n• Familiarity with Agile delivery methods and experience with Azure DevOps or JIRA\n• Solid understanding of database design principles and data modelling.\n• Experience using Azure Data Factory and Azure Databricks would be advantageous\n• Strong troubleshooting and problem-solving abilities\n• Positive proactive attitude, willing to turn their hand to any problem, and willing to work things out when they fall outside their area of direct expertise.\n\nIn return we will offer you a competitive benefits package, including on target bonus, private health cover and great c areer development prospects.\n\nWe offer Smart or Hybrid working, which allows you to balance your time between the home and office.\n\nAbout The Company\n\nAlliance Healthcare is a leading distributor and wholesaler of pharmaceutical, medical and healthcare products, serving over 16,200 pharmacies, hospitals and dispensing doctors throughout the UK generating approximately £10 Billion in annual revenue. We are now a business unit of AmerisourceBergen a $200 Billion company which is currently Number 8 in the Fortune 500.\n\nWe have an essential role to play in the medical supply chain and everything that we do as a company will ultimately impact upon the end user, the patient. It is our responsibility to offer a reliable service that ensures that our customers receive the right product, in the right place, at the right time.\n\nYou can contribute to this new team by helping the business modernise digitising process and automation to departments across the business as we modernise the Application portfolio to align our M365 solutions with SAP which will be delivered in Phases over the next 2-3 years.\n\nGlobal diversity, equity and inclusion are core to our purpose to create healthier futures. We believe in creating an inclusive environment where people across all dimensions of diversity can bring their whole selves to work to advance health equity for all. We enable our teams with career opportunities that challenge and inspire the very best to solve complex business problems impacting diverse patient populations in communities around the world.", "job_is_remote": false, "job_posted_at_timestamp": 1703092232, "job_posted_at_datetime_utc": "2023-12-20T17:10:32.000Z", "job_city": "Chessington", "job_state": null, "job_country": "GB", "job_latitude": 51.363583, "job_longitude": -0.296254, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=CoMn27RKJH4NjU8zAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T17:10:32.000Z", "job_offer_expiration_timestamp": 1705684232, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": true, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Engineer", "job_posting_language": "en", "job_onet_soc": "43911100", "job_onet_job_zone": "4", "job_naics_code": "325412", "job_naics_name": "Pharmaceutical Preparation Manufacturing"}, {"employer_name": "Gresham Hunt Limited", "employer_logo": null, "employer_website": null, "employer_company_type": null, "job_publisher": "My Valley Jobs Today", "job_id": "NsqROeskXwH-Ms3qAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Power Platform Engineer. Job in London My Valley Jobs Today", "job_apply_link": "https://jobs.wkbn.com/jobs/power-platform-engineer-london/1193446957-2/", "job_apply_is_direct": false, "job_apply_quality_score": 0.4531, "apply_options": [{"publisher": "My Valley Jobs Today", "apply_link": "https://jobs.wkbn.com/jobs/power-platform-engineer-london/1193446957-2/", "is_direct": false}], "job_description": "London, UK - Hybrid, 2 days/week in office £75,000 - £80,000\n\nGresham Hunt are currently partnered with a UK Financial Institution, seeking a highly technical Data Engineer for their London-based team.\n\nThis is part of a newly created team where you will be instrumental in designing and developing the firm's Power Platform service and Power BI Administration capability. As such we are looking for someone who can demonstrate strong experience in end-to-end PowerBI projects including; security, encryption, data policies, publishing reports on to service, access permission etc.The successful candidate will have:\n• Extensive experience working with Cloud and On-premise Power BI solutions\n• Experience of administering Power Platform and Power BI Service\n• Experience of developing applications using Power Apps\n• Experience of developing robotic process automation with Power Automate\n• Experience using Azure Portal and applying resources\n• Experience of Azure AD and the management of Groups, Roles and Users\n• Experience of building and maintaining Power BI Dataflows\n• Prior experience working in a Financial Services firm and an understanding of the UK Retail Payments market would be highly desirable", "job_is_remote": false, "job_posted_at_timestamp": 1703136651, "job_posted_at_datetime_utc": "2023-12-21T05:30:51.000Z", "job_city": "London", "job_state": null, "job_country": "GB", "job_latitude": 51.507217, "job_longitude": -0.1275862, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=NsqROeskXwH-Ms3qAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": null, "job_offer_expiration_timestamp": null, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": null, "job_posting_language": "en", "job_onet_soc": "15113200", "job_onet_job_zone": "4"}, {"employer_name": "NICE", "employer_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Nice_Logo_2.svg/220px-Nice_Logo_2.svg.png", "employer_website": "http://www.nice.com", "employer_company_type": "Information", "job_publisher": "LinkedIn", "job_id": "DD6IJaMxRfRUvsd-AAAAAA==", "job_employment_type": "FULLTIME", "job_title": "SOC Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/soc-engineer-at-nice-3789006010", "job_apply_is_direct": false, "job_apply_quality_score": 0.7586, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/soc-engineer-at-nice-3789006010", "is_direct": false}, {"publisher": "Greenhouse", "apply_link": "https://boards.eu.greenhouse.io/nice/jobs/4246307101?gh_jid=4246307101", "is_direct": false}, {"publisher": "Glassdoor", "apply_link": "https://www.glassdoor.co.uk/job-listing/soc-engineer-nice-JV_IC3380757_KO0,12_KE13,17.htm?jl=1008989331177", "is_direct": true}, {"publisher": "Indeed", "apply_link": "https://uk.indeed.com/viewjob?jk=33421f11874cc870", "is_direct": true}, {"publisher": "Monster.co.uk", "apply_link": "https://www.monster.co.uk/job-openings/soc-engineer-eng--a5112c87-96eb-48e1-aef4-8eadc79713b9", "is_direct": false}, {"publisher": "SimplyHired", "apply_link": "https://www.simplyhired.co.uk/job/Jxt4QOjiYQnpgzo4YMR-Rr5QpBiC_OTZDrGAOLdh3jb0pKNsUSPMtA", "is_direct": false}, {"publisher": "Jobijoba UK", "apply_link": "https://www.jobijoba.co.uk/detail/92/301040f79a6cc8f9d833f6f308c1465f", "is_direct": false}, {"publisher": "ZipRecruiter UK", "apply_link": "https://www.ziprecruiter.co.uk/jobs/289505979-soc-engineer-at-nice", "is_direct": false}], "job_description": "At NICE, we don’t limit our challenges. We challenge our limits. Constantly. We’re relentless. We’re ambitious. And we make an impact. Our NICErs bring their A game and spend each day turning it into an A+. And if you’re like us, we can offer you the kind of challenge that will light a fire within you.\n\nSecurity Engineer\n\nLocation: London or Southampton, United Kingdom\n\nThe Security Engineer will assist in implementing and administering initiatives implemented by InfoSec, including security initiatives mandated by regulatory and compliance requirements. This position will be responsible to ensure that regular housekeeping activities are performed necessary to maintain and monitor processes and systems. Ensures that both Corporate and Production services are managed according to company policies, processes, compliance, and regulatory requirements.\n\nAs a Security Engineer, a Typical Day Might Include the Following:\n• Create, manage, and respond to security incidents and conduct analysis in accordance with existing processes and company security policies.\n• Installation, configuration, and administration of information security tools such as but not limited to endpoint protection, SIEM, XDR, WAF, vulnerability scanner and DLP.\n• Troubleshoot and resolve technical issues related to the security tools and security processes.\n• Coordinate with third party vendors.\n• Assist with internal and external audits associated with regulatory and compliance requirements.\n• Provide formal notification to the Information Security Leaders when changes are planned that may impact the approved security posture of NICE CXOne or the associated certification and accreditation.\n• Review and recommend improvements on information security processes.\n• This position requires a person who is a self-starter and able to function without constant oversight.\n\nTo Land This Gig You'll Need:\n• Knowledge on basic information security principles and theories\n• A minimum of 2 years working in IT and data networks\n• A minimum of 2 years in or with information security or security principles\n• Good English communication skills\n• Proven track record of solving problems\n• Good organization and project management skills\n• Advanced computer skills in desktop applications\n• Possess excellent analytic skills including numbers, patterns, processes and data flow\n\nBonus Experience:\n• Proficient with Microsoft Applications\n• Holder of COMPTIA Security+, CISA, CISSP, SSCP CCSK or related certification\n• Knowledge of GDPR, PCI, SOC2 , FedRAMP, IRAP and HIPAA compliance regulations.\n\nThis job description is not intended to be all-inclusive, and employees will also perform other reasonable related business duties as assigned by immediate supervisor and other management as required.\n\nThis job may require overtime, and working nighttime, early morning and weekend hours. This job may require on-call availability.\n\nAbout NICE\n\nNICE Ltd. (NASDAQ: NICE) software products are used by 25,000+ global businesses, including 85 of the Fortune 100 corporations, to deliver extraordinary customer experiences, fight financial crime and ensure public safety. Every day, NICE software manages more than 120 million customer interactions and monitors 3+ billion financial transactions.\n\nKnown as an innovation powerhouse that excels in AI, cloud and digital, NICE is consistently recognized as the market leader in its domains, with over 8,500 employees across 30+ countries.\n\nNICE is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, age, sex, marital status, ancestry, neurotype, physical or mental disability, veteran status, gender identity, sexual orientation or any other category protected by law.", "job_is_remote": false, "job_posted_at_timestamp": 1703113673, "job_posted_at_datetime_utc": "2023-12-20T23:07:53.000Z", "job_city": "Southampton", "job_state": null, "job_country": "GB", "job_latitude": 50.910545, "job_longitude": -1.4049017, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=DD6IJaMxRfRUvsd-AAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T23:07:53.000Z", "job_offer_expiration_timestamp": 1705705673, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": 24, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": true}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Engineer", "job_posting_language": "en", "job_onet_soc": "51914100", "job_onet_job_zone": "2", "job_naics_code": "511210", "job_naics_name": "Software Publishers"}, {"employer_name": "InterSystems", "employer_logo": "https://assets.intersystems.com/dims4/default/37246dc/2147483647/strip/true/crop/1200x630+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Finter-systems-brightspot.s3.amazonaws.com%2F43%2F0d%2F204777734e65a90a94e50f2e99f0%2Fints-creativedatatechnology-logo-1200x630.jpg", "employer_website": "http://www.intersystems.com", "employer_company_type": "Information", "job_publisher": "OnlyDataJobs", "job_id": "62cz_aoceVND1hoSAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Cloud Security Engineer", "job_apply_link": "https://onlydatajobs.com/job/307378/Cloud-Security-Engineer-Cambridgeshire-Cambridge", "job_apply_is_direct": false, "job_apply_quality_score": 0.5411, "apply_options": [{"publisher": "OnlyDataJobs", "apply_link": "https://onlydatajobs.com/job/307378/Cloud-Security-Engineer-Cambridgeshire-Cambridge", "is_direct": false}], "job_description": "Cloud Security Engineer\n\nA cloud security engineer must be conversant with a breadth of technologies used to protect data, workloads, and systems within cloud platforms.\n\nResponsibilities of a cloud security engineer include:\n• Designing and implementing cloud security strategies and policies that meet an organization's specific needs.\n• Ensuring the security of cloud-based data and applications against unauthorized access, theft, and other threats.\n• Conducting regular security assessments and audits to identify vulnerabilities and develop plans to address them.\n• Collaborating with other IT professionals, including network engineers, developers, security team, and operational team to integrate cloud security measures into existing systems and processes.\n• Staying up to date on the latest cloud security technologies, trends, and best practices.\n• Reviewing and understanding remediation options from application vulnerability monitoring and assessment tooling.\n\nSkills sought in a cloud security engineer:\n• Strong analytical and problem-solving skills, with an ability to think strategically and tactically about complex cloud security issues.\n• Excellent communication skills, including communicating complex technical concepts to non-technical stakeholders.\n• The ability to work independently but collaborate closely and effectively with developers and other IT professionals at project start and critical project junctures.\n• The ability to manage multiple projects and priorities and meet deadlines in a fast-paced environment.\n• Attention to detail and a commitment to quality work.\n\nTypical requirements for a cloud security engineer are:\n• A bachelor's or master's degree in computer science, information technology, or a related field.\n• At least two years of cloud security experience, focusing on designing and implementing secure cloud computing solutions or a Cybersecurity Degree.\n• A strong understanding of cloud computing technologies, including Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS).\n• Knowledge of security frameworks such as ISO 27001, NIST Cybersecurity Framework, and CIS Controls.\n• Familiarity with one or more cloud security platforms like Microsoft Azure, Amazon Web Services, and Google Cloud Platform.\n• Certifications such as Certified Cloud Security Professional (CCSP), Certified Information Systems Security Professional (CISSP), or Certified Cloud Architect (CCA) are preferred.\n\nDesirable experience for a cloud security engineer include:\n• Identity Access Management and Identity Provider technologies and features\n• Authentication and authorization strategies; SSO\n• DevSecOps practices and testing as part of CICD pipeline workflows\n• Key and secrets management services\n• Networking and security best practices using VPC/VNet/Subnet deployment\n• Kubernetes technology including network policy management\n• Experience with private link / endpoint strategies\n\nWe are an equal-opportunity employer and do not discriminate because of race, color, religion, sex, national origin, ancestry, marital status, veteran status, age, disability, sexual orientation or gender identity or expression or any other legally protected category. InterSystems is an E-Verify Employer in the United States.\n\nAbout InterSystems\n\nEstablished in 1978, InterSystems provides innovative data solutions for organizations with critical information needs in the healthcare, finance, and logistics sectors and beyond. Our cloud-first data platforms solve interoperability, speed, and scalability problems for organizations around the globe. InterSystems also develops and supports data management in hospitals through the world's most proven electronic medical record, as well as unified care records for health systems and governments through a powerful suite of healthcare data integration solutions. The company is committed to excellence through its award-winning, 24x7 support for customers and partners in more than 80 countries. Privately held and headquartered in Cambridge, Massachusetts, InterSystems has 25 offices worldwide. For more information, please visit InterSystems.com .", "job_is_remote": false, "job_posted_at_timestamp": 1703161171, "job_posted_at_datetime_utc": "2023-12-21T12:19:31.000Z", "job_city": "Cambridge", "job_state": null, "job_country": "GB", "job_latitude": 52.19508, "job_longitude": 0.1312729, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=62cz_aoceVND1hoSAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-21T12:19:31.000Z", "job_offer_expiration_timestamp": 1705839571, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": false, "degree_mentioned": true, "degree_preferred": true, "professional_certification_mentioned": true}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Security engineer", "job_posting_language": "en", "job_onet_soc": "15112200", "job_onet_job_zone": "4", "job_naics_code": "511210", "job_naics_name": "Software Publishers"}, {"employer_name": "ARC GROUP LTD", "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT7Xc-JX8ZkLtROMD9jTmttW6w0ouj7LuIpLvNp&s=0", "employer_website": null, "employer_company_type": null, "job_publisher": "LinkedIn", "job_id": "GSLn2nMWxXCZy233AAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Setting Out Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/setting-out-engineer-at-arc-group-ltd-3785613664", "job_apply_is_direct": false, "job_apply_quality_score": 0.7417, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/setting-out-engineer-at-arc-group-ltd-3785613664", "is_direct": false}, {"publisher": "Arc Group", "apply_link": "https://arcgroup.co.uk/job/setting-out-engineer-9826/", "is_direct": false}, {"publisher": "SaluteMyJob", "apply_link": "https://salutemyjob.com/jobs/setting-out-engineer-hatfield-hertfordshire/1193320023-2/", "is_direct": false}, {"publisher": "Diversity Dashboard", "apply_link": "https://diversitydashboard.co.uk/jobs/setting-out-engineer-hatfield-hertfordshire/1193320023-2/", "is_direct": false}, {"publisher": "CV-Library", "apply_link": "https://www.cv-library.co.uk/job/220797330/Setting-Out-Engineer", "is_direct": true}, {"publisher": "Adzuna", "apply_link": "https://www.adzuna.co.uk/jobs/details/4489398400", "is_direct": false}, {"publisher": "CRA Group", "apply_link": "https://cragroup.org.uk/jobs/setting-out-engineer-hatfield-hertfordshire/1193320023-2/", "is_direct": false}, {"publisher": "WANE Jobs", "apply_link": "https://jobs.wane.com/jobs/setting-out-engineer-hatfield-hertfordshire/1193320023-2/", "is_direct": false}], "job_description": "Vacancy Summary\n\nJob Title: Setting out engineer with equipment\n\nLocation: Hatfeild\n\nStart Date: January\n\nJob Type: 3 month contract\n\nCompany & Project\n\nAre you an experienced Senior Site Engineer currently looking for your next contract?\n\nWe are looking for a Senior Site Engineer to work on a 3 month contract in Hatfeild that is due to start in January working for a market leading civils contractor.\n\nDuties & Responsibilities of a Senior Site Engineer (including and not limited to):\n• Undertake day to day setting out duties with no supervision\n• Train, manage and mentor Junior Engineers\n• Manage and monitor all site sample / performance testing requirements and maintain records in line with the contract specification.\n• Complete hazard / risk assessments and method statements.\n• Manage the site service plans/ drawings. Issue permits accordingly.\n• Assist the site QS / Project Manager with providing the relevant information for records and claims purposes.\n• Monitor and control temporary works.\n• Develop and maintain relations with client, suppliers and sub-contractors.\n• Ensure all work complies with quality, safety and environmental policies and the requirements of the company procedures\n\nDesirable Experience & Qualifications required to work as a Senior Site Engineer:\n• Minimum 3 years recent in a Setting Out Engineer role\n• Ideally have experience working for a groundworks and civil engineering company.\n\nApplication Process: If you would like more information on this Setting out Engineer position or any other vacancy, please email your current CV through; where it will be reviewed and you will be contacted within 48 hours if your CV is of interest.", "job_is_remote": false, "job_posted_at_timestamp": 1703116964, "job_posted_at_datetime_utc": "2023-12-21T00:02:44.000Z", "job_city": "Hatfield", "job_state": null, "job_country": "GB", "job_latitude": 51.763367, "job_longitude": -0.22309, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=GSLn2nMWxXCZy233AAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-20T00:05:05.000Z", "job_offer_expiration_timestamp": 1705709105, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": 36, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Engineer", "job_posting_language": "en", "job_onet_soc": "17205100", "job_onet_job_zone": "4"}, {"employer_name": "Babcock International Group", "employer_logo": "https://www.babcockinternational.com/wp-content/uploads/2021/08/Babcoc-logo-web-scaled.jpg", "employer_website": "http://www.babcockinternational.com", "employer_company_type": "Engineering Services", "job_publisher": "LinkedIn", "job_id": "vnlV8uQ74TNsmWNxAAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Supportability Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/supportability-engineer-at-babcock-international-group-3778275869", "job_apply_is_direct": false, "job_apply_quality_score": 0.7622, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/supportability-engineer-at-babcock-international-group-3778275869", "is_direct": false}, {"publisher": "Energy Jobline", "apply_link": "https://www.energyjobline.com/job/supportability-engineer-18916342", "is_direct": false}, {"publisher": "Security Cleared Jobs", "apply_link": "https://www.securityclearedjobs.com/job/802019780/supportability-engineer/", "is_direct": false}, {"publisher": "Careermap", "apply_link": "https://careermap.co.uk/jobs/view/supportability-engineer-19", "is_direct": false}, {"publisher": "Indeed", "apply_link": "https://uk.indeed.com/viewjob?jk=57ae9db821054ffa", "is_direct": false}, {"publisher": "SaluteMyJob", "apply_link": "https://salutemyjob.com/jobs/supportability-engineer-plymouth-devon/1189973783-2/", "is_direct": false}, {"publisher": "Glassdoor", "apply_link": "https://www.glassdoor.co.uk/job-listing/supportability-engineer-ils-engineer-babcock-international-group-JV_IC3293433_KO0,36_KE37,64.htm?jl=1008353898121", "is_direct": false}, {"publisher": "WANE Jobs", "apply_link": "https://jobs.wane.com/jobs/supportability-engineer-plymouth-devon/1189973783-2/", "is_direct": false}], "job_description": "Job Title: Supportability Engineer\n\nLocation: Plymouth, Bristol, Leicester or Warrington + Hybrid Working\n\nCompensation: £34,160 - £44,044 dependent on experience + Benefits\n\nRole Type: Full time / Permanent\n\nRole ID: SF48452\n\nAt Babcock we’re working to create a safe and secure world, together, and if you join us, you can play your part as a Supportability Engineer at our Plymouth, Bristol, Leicester or Warrington site.\n\nThe role\n\nAs a Supportability Engineer, working in Integrated Logistic Support (ILS), you’ll have a role that’s out of the ordinary. You will be significant in supporting our nuclear deterrent whilst working within our Engineering Services Directorate.\n\nDay to day, you’ll be applying your engineering knowledge to support technical outputs and solutions in order to enable submarine availability and fit for purpose nuclear licenced infrastructure.\n\nAs part of the role you could be involved in one of the two main areas of influence:\n• In service; providing engineering support and thought to trafalgar, astute and vanguard class submarines whilst at sea and alongside to enable an optimised maintenance package and through life cost.\n• Concept and build; providing engineering support and thought to the future Ballistic Missile Submarines (SSBN) and Submersible Ship Nuclear Replacement (SSNA) class submarines through the design, down selection and build process, to provide support to the MoD and define the preferred support solution.\n\nThis role is full time 36 hours and will be based on site at either our Plymouth, Bristol, Leicester or Warrington site with hybrid working from home arrangements.\n\nEssential experience of the Supportability Engineer:\n• Carrying out or supporting technical investigations and analysis to provide data for problem assessment or resolution and for design of improvements\n• Production, review, and approval of calculations, analyses, drawings, models, design basis documentation and technical reports as assigned\n• Evaluating technical issues in order to develop proposals for investigations and/or solutions, including process improvements\n• Driving or supporting the development of Integrated Logistic Support (ILS) / Integrated Product Support (IPS) solutions\n• Providing help and direction to team members with reference to your experience; steering/ supporting continuous improvement activity\n\nQualifications of the Supportability Engineer:\n• Working towards professional registration of an accredited STEM body such as IMechE, IMarEST or IET\n• Qualified to minimum of HNC in a STEM discipline (e.g. Mechanical, Electrical, System, Data or Maths). Experience in lieu of formal education would be considered.\n\nIf you have ex-military / navy or industry experience in defining maintenance activities, predicting maintenance intervals, or support of complex assets, then we have opportunities at Babcock across a wide range of disciplines within our Integrated Logistic Support function and look forward to receiving your application.\n\nThe successful candidate must be able to achieve SC security clearance level for this role.\n\nOur Benefits\n• Generous holiday allowance\n• Matched contribution pension scheme, with life assurance\n• Employee share scheme\n• Employee shopping savings portal\n• Payment of Professional Fees\n• Reservists in the armed forces receive 10 days special paid leave\n• Holiday Trading is a benefit that allows the majority of employees to buy additional leave or to sell up to one working week of annual leave from their annual entitlement\n• ‘Be Kind Day’ enables employees to take one working day's paid leave a year (or equivalent hours) to undertake volunteering work with their chosen organisation or registered charity\n\nBabcock International\n\nFor over 130 years Babcock International have helped to defend nations, protect communities and build a better world. To continue, we must adapt, advance and be a sustainable business with a shared goal.\n\nIf you have a disability or need any reasonable adjustments during the application and selection stages, please let us know. We’re committed to building an inclusive culture where everyone’s free to thrive. We are happy to talk about flexible working - please ask about alternative patterns of work at interview.\n\nClosing date: 04/01/2024", "job_is_remote": false, "job_posted_at_timestamp": 1703106842, "job_posted_at_datetime_utc": "2023-12-20T21:14:02.000Z", "job_city": "Plymouth", "job_state": null, "job_country": "GB", "job_latitude": 50.375458, "job_longitude": -4.1426563, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=vnlV8uQ74TNsmWNxAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T21:14:02.000Z", "job_offer_expiration_timestamp": 1705698842, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": true, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Engineer", "job_posting_language": "en", "job_onet_soc": "15115100", "job_onet_job_zone": "3", "job_naics_code": "54133", "job_naics_name": "Engineering Services"}, {"employer_name": "ITL Vacuum", "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT1lBt39BdQdmksefmBUaR-lh5obyBVg3JZPlaM&s=0", "employer_website": "http://itl-vacuum.com", "employer_company_type": null, "job_publisher": "LinkedIn", "job_id": "3JkNvo9_Yq6EomE8AAAAAA==", "job_employment_type": "FULLTIME", "job_title": "Chamber Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/chamber-engineer-at-itl-vacuum-3790817063", "job_apply_is_direct": false, "job_apply_quality_score": 0.757, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/chamber-engineer-at-itl-vacuum-3790817063", "is_direct": false}, {"publisher": "Learn4Good", "apply_link": "https://www.learn4good.com/jobs/uk/engineering/2780029995/e/", "is_direct": false}], "job_description": "Job Title: Chamber Engineer\n\nLocation: Hastings, TN38 9BB\n\nSalary: £30,000 - £38,000 per annum DOE\n\nJob type: Full-time, Permanent\n\nThe Company:\n\nITL-Vacuum is a UK based business, manufacturing, sourcing and supplying ranges of Standard and Non-Standard Vacuum components, fittings and vessels within a range of industries utilising vacuum techniques. This includes Semi-Conductor, Research, Energy, Medical and general Industrial vacuum users.\n\nThe role:\n\nAs a Chamber Engineer you will be reporting to the Machine Shop Manager, and have strong experience in manufacturing vacuum chambers, with an understanding of engineering principles and materials science. Experience using XYZ milling machines, mechanical and materials knowledge and understanding of tools essential. You will be able to read and interpret engineering drawings. The ideal candidate will also be experienced in fabrication, fitting and some light welding. Also experience within a fast paced and high-volume environment.\n\nResponsibilities:\n\nManufacture vacuum chambers according to customer specifications.\n\nManufacture mid-range vacuum components, including fitting, tweaking and some light welding.\n\nManufacturing of high volume, less complex products as and when required.\n\nOperate and maintain manufacturing equipment and tools.\n\nAbility to work with minimal supervision and to follow instructions.\n\nCollaborate with engineers and other team members to optimise chamber design and performance.\n\nEnsuring all jobs issued are completed within the given timescales.\n\nTroubleshoot and resolve manufacturing-related issues and challenges.\n\nEnsuring compliance with all aspects of the Health & Safety & Quality Policy.\n\nTroubleshoot and resolve manufacturing-related issues and challenges.\n\nEnsuring compliance with all aspects of the Health & Safety & Quality Policy.About You:\n\nTo succeed in this role, you should have:\n\nPrevious experience in vacuum chamber manufacturing or a similar role.\n\nStrong knowledge of engineering principles and materials science.\n\nExperience within a fast paced and quick turn-around environment.\n\nExcellent interpersonal and team-player skills.\n\nExcellent problem-solving and analytical skills.\n\nCompetent in fitting and ability to fabricate from own jigs and fixtures.\n\nCompetent in reading and working from Engineering drawings.Please note the company is not able to offer sponsorship or relocation assistance for this role so candidates must already possess the right to live and work in the UK to be considered.\n\nPlease click on the APPLY button to send your CV and Cover Letter for this role.\n\nCandidates with the relevant experience or job titles of: Vacuum Chamber Engineer, Environmental Chamber Specialist, Test Chamber Engineer, Thermal Chamber Technician, Climatic Chamber Operator, Pressure Chamber Analyst, Altitude Chamber Technician, Cryogenic Chamber Engineer, High-Pressure Chamber Operator, Humidity Chamber Specialist, Space Simulation Chamber Technician, Thermal Vacuum Chamber Engineer may also be considered", "job_is_remote": false, "job_posted_at_timestamp": 1703092512, "job_posted_at_datetime_utc": "2023-12-20T17:15:12.000Z", "job_city": "Hollington", "job_state": null, "job_country": "GB", "job_latitude": 52.950264, "job_longitude": -1.661819, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=3JkNvo9_Yq6EomE8AAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T17:15:25.000Z", "job_offer_expiration_timestamp": 1705684525, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": 30000, "job_max_salary": 38000, "job_salary_currency": "GBP", "job_salary_period": "YEAR", "job_highlights": {}, "job_job_title": "Engineer", "job_posting_language": "en", "job_onet_soc": "17207200", "job_onet_job_zone": "4"}, {"employer_name": "CareerAddict", "employer_logo": "https://lookaside.fbsbx.com/lookaside/crawler/media/?media_id=100064536078638", "employer_website": "https://www.careeraddict.com", "employer_company_type": null, "job_publisher": "LinkedIn", "job_id": "V8MknNAOFBV9u7PUAAAAAA==", "job_employment_type": "CONTRACTOR", "job_title": "Exchange Engineer", "job_apply_link": "https://uk.linkedin.com/jobs/view/exchange-engineer-at-careeraddict-3789084061", "job_apply_is_direct": false, "job_apply_quality_score": 0.7017, "apply_options": [{"publisher": "LinkedIn", "apply_link": "https://uk.linkedin.com/jobs/view/exchange-engineer-at-careeraddict-3789084061", "is_direct": false}, {"publisher": "Indeed", "apply_link": "https://uk.indeed.com/viewjob?jk=3186b6c9c2bcdcdf", "is_direct": false}, {"publisher": "SaluteMyJob", "apply_link": "https://salutemyjob.com/jobs/exchange-engineer-east-kilbride-lanarkshire/1187229049-2/", "is_direct": true}, {"publisher": "KNWA & FOX24 Jobs", "apply_link": "https://jobs.nwahomepage.com/jobs/exchange-engineer-east-kilbride-lanarkshire/1187229049-2/", "is_direct": false}, {"publisher": "WANE Jobs", "apply_link": "https://jobs.wane.com/jobs/exchange-engineer-east-kilbride-lanarkshire/1187229049-2/", "is_direct": false}, {"publisher": "CareerAddict Jobs", "apply_link": "https://jobs.careeraddict.com/post/86093343", "is_direct": false}, {"publisher": "SimplyHired", "apply_link": "https://www.simplyhired.co.uk/job/Nxr-Y9_q_A3K_1hikC2H6KVpaoNRFKznpBdjNVTPWQyUo7P5pqLcHg", "is_direct": false}, {"publisher": "Adzuna", "apply_link": "https://www.adzuna.co.uk/jobs/details/4490078107", "is_direct": true}], "job_description": "We are looking for an MS Exchange Engineer to work within the public sector.\n\nLocation: Hybrid working- East Kilbride\n\nAbout the role:You will be responsible contributing to strategic and tactical engineering road maps in the Messaging and high assurance gateway space, making sure that road maps are future proofed to meet organizational and user needs.\n\nEssential Skills\n\nThe ideal candidates will hold active SC clearance and have a proven MS Exchange Engineering background, with the following skills/experience:\n• Experience of Installation and configuration of Exchange Server 2019.\n• Experience of Engineer solutions centred in the Messaging and mail gateway space.\n• Experience of Exchange DAG environment\n• Knowledge of Active Directory, including management and maintenance of users and security groups\n• PowerShell skills.\n• Knowledge of TLS certificates for end point encryption.\n• Experience in Incident, Change& Problem management.\n• Knowledge of cross domain technologies such as mail gateways(Desirable)\n• Experience of Atlassian Jira and Confluence(Desirable)\n• Knowledge of Identity Management ADFS(Desirable)", "job_is_remote": false, "job_posted_at_timestamp": 1703109546, "job_posted_at_datetime_utc": "2023-12-20T21:59:06.000Z", "job_city": "East Kilbride", "job_state": null, "job_country": "GB", "job_latitude": 55.76435, "job_longitude": -4.1769986, "job_benefits": null, "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=data+engineer+jobs+in+uk&start=30&chips=date_posted:today&schips=date_posted;today&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=data+engineer+jobs+in+uk&htidocid=V8MknNAOFBV9u7PUAAAAAA%3D%3D", "job_offer_expiration_datetime_utc": "2024-01-19T21:59:09.000Z", "job_offer_expiration_timestamp": 1705701549, "job_required_experience": {"no_experience_required": false, "required_experience_in_months": null, "experience_mentioned": true, "experience_preferred": false}, "job_required_skills": null, "job_required_education": {"postgraduate_degree": false, "professional_certification": false, "high_school": false, "associates_degree": false, "bachelors_degree": true, "degree_mentioned": false, "degree_preferred": false, "professional_certification_mentioned": false}, "job_experience_in_place_of_education": false, "job_min_salary": null, "job_max_salary": null, "job_salary_currency": null, "job_salary_period": null, "job_highlights": {}, "job_job_title": "Engineer", "job_posting_language": "en", "job_onet_soc": "15114200", "job_onet_job_zone": "4"}]}